{
    "posts": [
        {
            "id": "1",
            "category_id": "3",
            "user_id": "2",
            "title": "Nanabun no Nijyuuni",
            "slug": "nanabun-no-nijyuuni",
            "image": "post-images\/jfIgaxgA0wKa6Nxck7Z2FmsJaBXYa8TK55Y00eDU.jpg",
            "excerpt": "22\/7(ナナブンノニジュウニ nanabun no nijyuuni) or shortened as ナナニジ (nananiji) is a Japanese digital seiyuu idolgroup. The project is described as \"Idols Who Cross Dimensions\" and was formed by a...",
            "body": "<div><strong>22\/7<\/strong>(ナナブンノニジュウニ <em>nanabun no nijyuuni<\/em>) or shortened as ナナニジ (<em>nananiji<\/em>) is a Japanese <a href=\"https:\/\/nanabunnonijyuuni.fandom.com\/wiki\/Digital_seiyuu_idol\">digital seiyuu idol<\/a>group. The project is described as \"Idols Who Cross Dimensions\" and was formed by a collaboration of Yasushi Akimoto, Aniplex and Sony Music Records. The group originally consisted of 11 members and currently consists of 10.<br><br><br><\/div><h1>Introduction<\/h1><div><strong>22\/7<\/strong> (nanabun no nijyuuni) is a Japanese digital idol and voice actors’ project produced by famed music producer Yasushi Akimoto in collaboration with Aniplex and Sony Music Records. By combining work from well-regarded talents in the anime industry with state-of-the-art technology, 22\/7 (nanabun no nijyuuni) has perfectly blended elements of anime with real-life idols to create a unique entertainment experience. Since the group’s debut in 2017, they have gained a global following for their multimedia content, which includes voice acting, Virtual YouTuber activities, and music performances.<a href=\"https:\/\/nanabunnonijyuuni.fandom.com\/wiki\/22\/7#cite_note-3\"><br><\/a><br><br><\/div><h1>Etymology<\/h1><div>\"<strong>22\/7 <\/strong>(twenty-two sevenths)\" is a rational number that is an approximation of π (Pi), a number that goes on for infinity. The group was named it to represent the infinite possibilities and opportunities that could happen to the group. In the anime it was given by <a href=\"https:\/\/nanabunnonijyuuni.fandom.com\/wiki\/The_Wall\">the Wall<\/a>. In real life, it was given by their producer Yasushi Akimoto.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 05:05:44",
            "updated_at": "2024-05-07 05:05:44"
        },
        {
            "id": "2",
            "category_id": "3",
            "user_id": "2",
            "title": "Bang Dream",
            "slug": "bang-dream",
            "image": "post-images\/QfxysnDSy1vG2FOE00CgHCjUltdBPiSWWMj02V7E.png",
            "excerpt": "BanG Dream![1] (バンドリ!, Bandori!) is a Japanese multimedia project developed by Bushiroad.BanG Dream! has released music CD's, anime music videos, live concert videos, manga adaptions, games, card...",
            "body": "<div><strong>BanG Dream!<\/strong>[1] (バンドリ!, Bandori!) is a Japanese multimedia project developed by Bushiroad.<br><br>BanG Dream! has released music CD's, anime music videos, live concert videos, manga adaptions, games, card games, and anime series.<br><br><strong>Bushiroad<\/strong> launched the project in January 2015. Poppin'Party was formed in February 2015. With the creation of the mobile game, four other bands were created namely Afterglow, Pastel*Palettes, Roselia, and Hello, Happy World!. In February 2020, a new band, Morfonica, was added.<br><br>An all-girls' band project, THE THIRD, was announced in January of 2018. The band changed their name to RAISE A SUILEN after THE THIRD 2nd Live and became part of the second season of the anime. In the mobile game the band's members appeared in the stories occasionally, and they were finally implemented in-game in June 2020.<br><br>An all-males' band project, ARGONAVIS from BanG Dream!, was announced in May of 2018. This project exists in a separate universe, and was announced to not going to have any interaction with the Girls Band Party! universe.[2] The project was later renamed to from ARGONAVIS.<br><br>A new all-girls' band, MyGO!!!!!, which is meant to be a synchronization of \"reality\" and \"virtual\", was announced at the end of April 2022.<br><br><\/div><h1><strong>Anime<\/strong><\/h1><div>A group of high school girls, Toyama Kasumi, Ichigaya Arisa, Hanazono Tae, Ushigome Rimi, and Yamabuki Saaya, form an all-girl band called Poppin'Party in order to perform at the live house, SPACE.<br><br><br><\/div><ul><li>The first season aired from January 21 to April 22, 2017 with 13 episodes<\/li><li>An OVA aired on August 19 and 20 and included on the first season's 7th Blu-ray Volume that was released on November 22, 2017.<\/li><li>A second season aired from January 3 - March 28, 2019<\/li><li>A third season aired from January 23 - April 7, 2020.<\/li><li>A season focused on the franchise's 8th band, MyGO!!!!!, aired from June 29, 2023 - September 14, 2023.<\/li><li>A season focused on the franchise's 9th band, ,Ave Mujica will start airing in January 2025.<\/li><\/ul><div><br><strong>BanG Dream! Girls Band Party!☆PICO<\/strong><br>BanG Dream! Girls Band Party!☆PICO, also called BanG Dream! Garupa☆Pico (ガルパ☆ピコ), is a mini-anime series featuring the girls from the mobile game Girls Band Party! which aired starting July 5, 2018.<br><br>A second season, BanG Dream! GARUPA☆PICO ~Ohmori~, started airing May 7, 2020. A third season, BanG Dream! GARUPA☆PICO Fever!, has been announced to be under production and slated to start airing October 7, 2021.<br><br><br><strong>Movies<\/strong><br><br><\/div><ul><li>BanG Dream! FILM LIVE - an outdoor concert movie featuring the bands Poppin'Party, Afterglow, Pastel*Palettes, Roselia, and Hello, Happy World!. It premiered on September 13, 2019.<\/li><li> BanG Dream! Episode of Roselia - a two-part movie focusing on the band Roselia. The first part, \"Promise\", premiered on April 23, 2021 while the second part, \"Song I am.\", premiered on June 25, 2021.<\/li><li>BanG Dream! FILM LIVE 2nd Stage - another concert movie, but this time, it also features the two new bands: Morfonica and RAISE A SUILEN. It premiered on August 20, 2021.<\/li><li>BanG Dream! Poppin'Dream! - a movie focusing on the band Poppin'Party. It premiered on January 1, 2022.<\/li><li>CiRCLE THANKS PARTY! - a two-part special for the 5th anniversary of the game. It premiered on March 10 &amp; 17, 2022.<\/li><li>BanG Dream! Morfonication - a two-part movie focusing on the band Morfonica. The first part, \"Summer Monica Project\", premiered on July 28 2022, while the second part, \"Shining Days\", premiered on July 29, 2022.<\/li><\/ul>",
            "published_at": null,
            "created_at": "2024-05-07 05:32:53",
            "updated_at": "2024-05-07 06:04:18"
        },
        {
            "id": "3",
            "category_id": "3",
            "user_id": "2",
            "title": "No Game No life",
            "slug": "no-game-no-life",
            "image": "post-images\/Hzi1F52MA7LbOTd5OixI7coUoqO3ROSGwlmlMuoP.jpg",
            "excerpt": "No Game No Life is a surreal comedy series that follows Sora and Shiro, shut-in NEET siblings and the online gamer duo behind the legendary username \"Blank.\" They view the real world as just another l...",
            "body": "<div>No Game No Life is a surreal comedy series that follows Sora and Shiro, shut-in NEET siblings and the online gamer duo behind the legendary username \"Blank.\" They view the real world as just another lousy game; however, a strange e-mail challenging them to a chess match changes everything—the brother and sister are plunged into an otherworldly realm where they meet Tet, the God of Games.<br><br>The mysterious god welcomes Sora and Shiro to Disboard, a world where all forms of conflict—from petty squabbles to the fate of whole countries—are settled not through war, but by way of high-stake games. This system works thanks to a fundamental rule wherein each party must wager something they deem to be of equal value to the other party's wager. In this strange land where the very idea of humanity is reduced to child's play, the indifferent genius gamer duo of Sora and Shiro have finally found a real reason to keep playing games: to unite the sixteen races of Disboard, defeat Tet, and become the gods of this new, gaming-is-everything world.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 05:40:40",
            "updated_at": "2024-05-07 05:40:40"
        },
        {
            "id": "4",
            "category_id": "3",
            "user_id": "3",
            "title": "chainsaw man",
            "slug": "chainsaw-man",
            "image": "post-images\/V4ofHAo13zzJCYYAU0WuqI0ztakboIUzODaLbND7.jpg",
            "excerpt": "Chainsaw Man(Jepang: チェンソーマン, Hepburn: Chensō Man) adalah sebuah seri manga shōnen asal Jepang yang ditulis dan diilustrasikan oleh Tatsuki Fujimoto. Manga ini dimuat berseri dalam majalah Week...",
            "body": "<div><br><\/div><div><strong><em>Chainsaw Man<\/em><\/strong>(<a href=\"https:\/\/id.wikipedia.org\/wiki\/Bahasa_Jepang\">Jepang<\/a>: チェンソーマン, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Alih_aksara_Hepburn\">Hepburn<\/a>: <em>Chensō Man<\/em>) adalah sebuah seri <a href=\"https:\/\/id.wikipedia.org\/wiki\/Manga\">manga<\/a> <a href=\"https:\/\/id.wikipedia.org\/wiki\/Manga_sh%C5%8Dnen\"><em>shōnen<\/em><\/a> asal Jepang yang ditulis dan diilustrasikan oleh <a href=\"https:\/\/id.wikipedia.org\/wiki\/Tatsuki_Fujimoto\">Tatsuki Fujimoto<\/a>. Manga ini dimuat berseri dalam majalah <a href=\"https:\/\/id.wikipedia.org\/wiki\/Weekly_Sh%C5%8Dnen_Jump\"><em>Weekly Shōnen Jump<\/em><\/a> terbitan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Shueisha\">Shueisha<\/a> sejak bulan Desember 2018, dan telah diterbitkan menjadi tujuh belas volume <a href=\"https:\/\/id.wikipedia.org\/wiki\/Tank%C5%8Dbon\"><em>tankōbon<\/em><\/a> per bulan April 2024.<\/div><div><a href=\"https:\/\/id.wikipedia.org\/wiki\/Viz_Media\"><br>Viz Media<\/a> melisensi manga ini untuk diterbitkan dalam bahasa Inggris di wilayah Amerika Utara. Volume pertamanya diterbitkan pada bulan Oktober 2020.<br><br><strong>Pengarang<\/strong> | <a href=\"https:\/\/id.wikipedia.org\/wiki\/Tatsuki_Fujimoto\">Tatsuki Fujimoto<\/a><br><strong>Penerbit<\/strong> | <a href=\"https:\/\/id.wikipedia.org\/wiki\/Shueisha\">Shueisha<\/a><br><strong>Penerbit bahasa Inggris<\/strong> | <a href=\"https:\/\/id.wikipedia.org\/wiki\/Amerika_Utara\">NA<\/a><a href=\"https:\/\/id.wikipedia.org\/wiki\/Viz_Media\">Viz Media<\/a><br><strong>Imprint<\/strong> | <a href=\"https:\/\/id.wikipedia.org\/wiki\/Jump_Comics\">Jump Comics<\/a><br><strong>Majalah<\/strong> | <a href=\"https:\/\/id.wikipedia.org\/wiki\/Weekly_Sh%C5%8Dnen_Jump\">Weekly Shōnen Jump<\/a>(3 Desember 2018 – 14 Desember 2020)<a href=\"https:\/\/id.wikipedia.org\/w\/index.php?title=Sh%C5%8Dnen_Jump%2B&amp;action=edit&amp;redlink=1\">Shōnen Jump+<\/a>(13 Juli 2022 – sekarang)<br><strong>Demografi<\/strong> | <a href=\"https:\/\/id.wikipedia.org\/wiki\/Manga_sh%C5%8Dnen\"><em>Shōnen<\/em><\/a><br><strong>Terbit<\/strong> | 3 Desember 2018 – sekarang<br><strong>Volume<\/strong> | 17 (<a href=\"https:\/\/id.wikipedia.org\/wiki\/Chainsaw_Man#Daftar_volume\">Daftar volume<\/a>)<br><br><strong><em>Sinopsis<\/em><\/strong><br>Denji yang kehidupan remaja normalnya hilang. Ia tidak memiliki apa-apa selain hutang ayahnya yang sangat besar di Yakuza. Teman satu-satunya adalah hewan peliharaannya bernama Pochita. Selain itu, ada pula iblis gergaji mesin, yang dengan itu dirinya membunuh iblis demi uang dari Yakuza.<\/div><div><br>Dalam kehidupan yang buruk ini, ia hanya bisa berharap dengan memimpikan kehidupan baik yang sederhana, hidup dengan makanan enak dan pacar cantik di sisinya. Tapi pengkhianatan yang dilakukan oleh Yakuza menyebabkan kematian Denji dengan sangat brutal. Hingga hal ini menghancurkan semua harapannya untuk mencapai kebahagiaan.<br><br><\/div><div><br>Hebatnya, sosok Denji yang telah mati ini bangkit dengan kekuatan iblis, yang membuatnya mampu untuk mengubah bagian tubuhnya menjadi gergaji mesin. Karena kemampuan baru Denji inilah, menimbulkan risiko bagi masyarakat, pemburu setan elit Biro Keamanan Publik, hingga Makima. Denji mencurahkan segalanya dan bertarung dengan sekuat tenaga untuk mewujudkan mimpinya yang naif.<\/div><div><strong><br><\/strong><strong><em>Anime<\/em><\/strong><\/div><div>Pada 14 Desember 2020, diumumkan bahwa manga tersebut akan menerima adaptasi serial televisi anime yang diproduksi oleh <a href=\"https:\/\/id.wikipedia.org\/wiki\/MAPPA\">MAPPA<\/a>. Mereka memiliki presentasi panggung di <a href=\"https:\/\/id.wikipedia.org\/wiki\/Jump_Festa\">Jump Festa<\/a> '21, sebagai bagian dari rangkaian presentasi panggung Jump Studio yang diadakan secara online pada 19-20 Desember 2020. <a href=\"https:\/\/id.wikipedia.org\/wiki\/Trailer_(promosi)\">Trailer<\/a> pertama untuk serial anime ini ditayangkan di acara \"MAPPA Stage 2021 – 10th Anniversary\", yang diadakan pada tanggal 27 Juni 2021. Anime ini disutradarai oleh Ryū Nakayama (sutradara) dan Masato Nakazono (kepala sutradara episode), dengan skrip oleh Hiroshi Seko, desain karakter oleh Kazutaka Sugiyama, dan desain setan oleh Kiyotaka Oshiyama. Tatsuya Yoshihara melayani sebagai direktur aksi dan Yūsuke Takeda mengarahkan seni. Naomi Nakano adalah seniman kunci warna dan Yohei Miyahara mendesain layarnya. Serial ini disiarkan di <a href=\"https:\/\/id.wikipedia.org\/wiki\/TV_Tokyo\">TV Tokyo<\/a> dan jaringan lain dari 12 Oktober hingga 28 Desember 2022.<\/div><div><a href=\"https:\/\/id.wikipedia.org\/wiki\/Crunchyroll\"><br>Crunchyroll<\/a> telah melisensikan serial ini di luar Asia, dan mulai mengalirkan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Penyulihan_suara\">sulih suara<\/a> bahasa Inggris pada 25 Oktober 2022. Medialink melisensi seri ini di Asia-Pasifik.<\/div><div><br><strong><em>Pemain <br><\/em><\/strong><em>Denji<\/em>-Anak laki-laki yang biasa saja<br><em>Makima<\/em>-Pemburu iblis keamanan publik<br><em>Power<\/em>-Pemburu iblis keamanan publik, pasukan Makima<br><em>Hayakawa\/Aki<\/em>-Pemburu iblis keamanan publik<br><em>Pochita<\/em>-Iblis gergaji<br><em>Himeno<\/em>-Pemburu iblis keamanan publik<br><em>Malaikat Iblis<\/em>-Iblis dan pemburu iblis keamanan publik<br><em>Kishibe<\/em>-Pemburu iblis keamanan publik<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 05:49:47",
            "updated_at": "2024-05-07 05:54:33"
        },
        {
            "id": "5",
            "category_id": "5",
            "user_id": "2",
            "title": "Genshin Impact",
            "slug": "genshin-impact",
            "image": "post-images\/AWrd7arvocCFY6205EaeTl2WANp23beCeLCMuB5Z.jpg",
            "excerpt": "Genshin Impact (Chinese: 原神 Yuánshén) is a free-to-play action role-playing game developed and published by miHoYo Co., Ltd. Outside of China, the publisher is miHoYo's subsidiary Cognosphere Pte.,...",
            "body": "<div><br><strong>Genshin Impact<\/strong> (Chinese: 原神 <em>Yuánshén<\/em>) is a free-to-play action role-playing game developed and published by miHoYo Co., Ltd. Outside of China, the publisher is miHoYo's subsidiary Cognosphere Pte., Ltd. d\/b\/a HoYoverse.<br><br>The game features a fantasy open-world environment and action based combat system using elemental magic, character switching, and a gacha monetization system for players to obtain new characters, weapons, and other resources. The game can only be played with an internet connection and features a limited multiplayer mode allowing up to four players in a world.<br><br><br><\/div><h1><strong>Gameplay<\/strong><\/h1><div>Players explore the game's large fantasy world, called Teyvat, with over 60 characters and various points of interest spread across the map. The game features an action combat playstyle that allows the player to swap between 4 individual characters in a party to quickly combo attacks. Single-player gameplay is the focus of the game, with Co-Op Mode available for certain activities.<br><br>Each character has two unique combat skills: an Elemental Skill and an Elemental Burst. The Elemental Skill can be used at any time except for the cooldown period immediately after use, while the Elemental Burst has an Energy Cost, requiring the user to amass sufficient Energy first.<br><br>Tutorial Elements Elemental Reaction Overloaded<br>Characters have control over one of seven natural elements: <strong>Anemo, Cryo, Dendro, Electro, Geo, Hydro, <\/strong>and<strong> Pyro.<\/strong> Combining these elements using Elemental Reactions is encouraged to quickly defeat enemies.<br><br>Players can venture inside Domains, temple-like instances scattered across the map, to complete the challenges within and obtain either one-time rewards or certain materials required for character development. Once characters are properly geared, players can choose to enter the Spiral Abyss, a special type of Domain consisting of different floors of combat challenges.<br><br>Cooking and crafting are other significant aspects of Genshin Impact's gameplay. Players gather many resources in the course of their adventure, some of which can be turned into dishes via cooking, and potions and Character Development Items via crafting. Dishes can regenerate characters' health, boost attack or defensive abilities, and decrease stamina consumption, while potions can increase a character's resistance against or damage for an element.<br><br>Further progression in the game unlocks the Housing system, known as the Serenitea Pot, in which players can create furnishings and place them in a realm layout, gaining access to rewards and level-up materials.<br><br>The Fishing system allows players to catch fish, which can be displayed in the Serenitea Pot, exchanged at each nation's Fishing Association for rewards, or processed into fish as a cooking ingredient.<\/div><div><br><br><br><\/div><h1><strong>Story<\/strong><\/h1><div>The story of Genshin Impact takes place in the world of Teyvat which is home to seven major nations: Mondstadt, Liyue, Inazuma, Sumeru, Fontaine, Natlan, and Snezhnaya. These nations are ruled over by deities known as Archons, part of a group of gods called \"The Seven.\" Each Archon is associated with one of the seven elements of Teyvat, which are also reflected in their nation's landscape and culture. For example, the nation of Mondstadt is ruled over by Barbatos the Anemo Archon, and so the element of wind is an important symbol known by its people. Apart from the seven nations, there was the nation of Khaenri'ah that lived independently from the authority of gods.<br><br>Celestia is the main heavenly body that presides over Teyvat and is in direct connection with The Seven. A floating island seen in the sky is believed to be it, allegedly the home to gods and also mortals who have ascended to godhood. Humans that are granted Visions, magical gems that grant bearers the ability to command elemental power, are called \"allogenes\" — ones with the potential to reach godhood.<br><br>While gods rule, the nations also have their own human governing bodies: the Knights of Favonius to Mondstadt, the Qixing to Liyue, the Shogunate to Inazuma, the Akademiya to Sumeru, and the Maison Gardiennage to Fontaine.<br><br><br><\/div><h1><strong>Plot<\/strong><\/h1><div>A pair of \"star traveler\" twins who visit different worlds arrive in the world of Teyvat and witness the destruction of the nation of Khaenri'ah. While attempting to flee the chaos, an unnamed god blocks their path and separates them: she captures one and seals away the power of the other. The sealed twin (known as the \"Traveler\") awakens five hundred years later and meets Paimon, who becomes their companion. For months, they travel together and then make their way to Mondstadt. There, they begin the search for the Traveler's missing sibling.<br><br><br><\/div><h1><strong>Development and Release<\/strong><\/h1><div>Genshin Impact began its development in January 2017 with the working title \"崩坏4.\"At that time, producer Haoyu Cai (蔡浩宇) considered creating a new project to enhance miHoYo's core research and development capabilities and present products with significant quality improvement to players in the future. The idea of creating an open-world game came out of that. During the next seven months, the team tried several prototypes. After Cai played Nintendo's The Legend of Zelda: Breath of the Wild, the team took inspiration from the game's world exploration experience. Other inspirations came from the random events of Grand Theft Auto, the strategy of Divinity: Original Sin, and game developer Naughty Dog.<br><br>The production team initially had 150 people. They faced the difficulty of creating an open world, so it grew to 300 people by mid-2019, then 500 by April 2020,and then 700 by February 2021. Originally, two years were given for production but got extended by year. The research and development cost of the project began with $25 million and then exceeded $100 million, which was recouped two weeks after the game's release. Much of the game's budget got invested in music production. Yu-Peng Chen (陈宇鹏), also known as Zhiyi Chen (陈致逸), joined the HOYO-MiX team as a music producer and composed the scores for the Mondstadt and Liyue regions.<br><br>Genshin Impact had its first beta testing in June 2019, focused on core gameplay mechanisms and the Mondstadt region. In early 2020, the overseas promotion of the game got affected by the COVID-19 pandemic. Development also got delayed by a month as working from home was almost impossible, and employees could not access office equipment. The second beta testing came in March and featured Liyue, and then the third beta testing came in July. The game got released on September 28, 2020, for the Microsoft Windows, PlayStation 4, Android, and iOS platforms.<br><br>The game was made available for PlayStation 5 on April 28, 2021 with enhanced textures and faster loading times compared to PlayStation 4. Later, it got released on the Epic Games Store for Windows users on June 9.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 06:35:35",
            "updated_at": "2024-05-07 06:35:35"
        },
        {
            "id": "6",
            "category_id": "4",
            "user_id": "3",
            "title": "Kompor Listrik",
            "slug": "kompor-listrik",
            "image": "post-images\/jm6kBqBiNLlWPs5C6KfTFSqu3DgLG4U3aYTmI9kQ.webp",
            "excerpt": "Kompor ListrikKompor listrik adalah peralatan yang berfungsi untuk memasak makanan menggunakan sumber listrik. Fungsi kompor listrik sama persis dengan kompor gas.Mengutip buku Menggunakan, Merawat da...",
            "body": "<div><strong>Kompor Listrik<br><\/strong>Kompor listrik adalah peralatan yang berfungsi untuk memasak makanan menggunakan sumber listrik. Fungsi kompor listrik sama persis dengan kompor gas.<br><br>Mengutip buku Menggunakan, Merawat dan Memperbaiki Peralatan Dapur oleh Daryanto, kompor listrik memiliki elemen pemanas yang diletakkan di bagian dalam kepala kompor. Ketika kompor dihubungkan ke sumber listrik dan dihidupkan, maka arus listrik akan mengalir ke dalam elemen. Dengan mengalirnya arus listrik, terjadi pemanasan akibat tahanan elemen tersebut.<br><br>Selain pemakaiannya yang mudah, kompor jenis ini juga lebih aman, karena tidak memerlukan tabung gas. Kompor ini juga lebih mudah dibersihkan, karena hampir semua jenisnya menggunakan bahan kaca dengan permukaan yang rata.<br><br>Meski begitu, ada kekurangan kompor listrik dibandingkan dengan kompor gas. Waktu pemanasan kompor listrik relatif lebih lambat untuk kapasitas yang sama. Kompor ini juga memerlukan daya listrik yang relatif besar, yaitu minimal 1.000 W.<br><br><strong>Jenis-jenis Kompor Listrik<br><\/strong>1.<em> Kompor listrik konvensional<\/em>, Kompor listrik menggunakan listrik sebagai sumber panas yang dialirkan melalui kabel nichrome menuju gulungan besi di atas kompor. Level panasnya bisa diatur, tapi efeknya tidak langsung terasa karena butuh penyesuaian panas. Kompor jenis ini lebih cocok untuk pemakaian standar dan instan.<br><br>2.<em> Kompor induksi<\/em>, Kompor induksi menggunakan elektromagnet untuk menghasilkan panas. Pada bagian bawah area masak kompor, ada lilitan logam.<br><br>Ketika kompor dinyalakan, arus bolak-balik akan mengalir melalui lilitan dan memproduksi medan magnet yang tidak terlihat. Jika diletakkan peralatan masak yang terbuat dari besi atau stainless steel yang bersifat magnetik, maka medan magnet yang diproduksi akan menginduksikan arus listrik dan menjadikannya panas.<br><br>Cara kerja kompor ini yaitu dengan cara memanaskan peralatan masak di atasnya. Sehingga tanpa peralatan masak yang magnetik, kompor tidak akan bekerja.<br><br>3. <em>Kompor listrik infrared<\/em>, Kompor listrik ini menggunakan lampu halogen dalam logam antikorosi. Lampu halogennya dikelilingi oleh radiasi kumparan untuk menghasilkan panas yang merata. Panas tersebut kemudian ditransfer ke peralatan masak di atas kompor melalui infra merah secara langsung.<br><br>Kompor jenis ini bisa dipakai untuk segala jenis peralatan masak, kecuali plastik. Namun, permukaan kompor akan sangat panas, jadi pengguna harus berhati-hati agar tidak menyentuhnya.<em><br><\/em><strong><em><br><\/em><\/strong><strong>Cara Merawat Kompor Listrik :<\/strong><br>- Nyalakan sesuai petunjuk. Ada berbagai desain dari kompor listrik, jadi perhatikan tata cara menyalakannya dengan benar. Ada yang dinyalakan dengan menekan tombol, ada yang diputar.<br>- Letakkan peralatan masak di cooktop atau lempengan kompor.<br>- Proses memasak dengan kompor listrik bisa sangat cepat. Jadi, ketahui estimasi waktu lamanya memasak dengan benar. Cobalah memasak dengan beragam cara, mulai dari menggoreng, menumis dan mengukus.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 06:46:02",
            "updated_at": "2024-05-07 06:46:02"
        },
        {
            "id": "7",
            "category_id": "5",
            "user_id": "2",
            "title": "Blue Archive",
            "slug": "blue-archive",
            "image": "post-images\/qWgUyXrmijaNsn4dZASzq55uBDCoeIdmZoVwCZY3.jpg",
            "excerpt": "Blue Archive(ブルーアーカイブ) is a Gacha RPG mobile title developed by NEXON GAMES and published by Yostar. It was released in 04 February 2021.The Global version is published by Nexon and was releas...",
            "body": "<div><strong>Blue Archive<\/strong>(ブルーアーカイブ) is a Gacha RPG mobile title developed by NEXON GAMES and published by Yostar. It was released in 04 February 2021.<br><br><\/div><div>The Global version is published by Nexon and was released on November 8th, 2021, with support available in Korean, Traditional Chinese and Thai. China version of the game is released on August 3rd, 2023 in Simplified Chinese with Yostar as publisher.<br><br><br><\/div><h1><strong>General Information<\/strong><\/h1><div>Producer Kim Yong-ha's (who made Qurare : MAGIC LIBRARY), new collective mobile game that was being developed under the name 'Project MX' by a company called NEXON GAMES in Korea.<br><br>The game is described as <em>\"An RPG about finding miracles in everyday life.\"<br><br><\/em><br><\/div><h1><strong>History<\/strong><\/h1><div>The game was first introduced by NAT Games (later known as Nexon Games) and Yostar by its initial name, Project MX. The announcement, alongside the first promotion video and arts was released in February 2020. Yostar announced the mobile game and held closed beta tests for the Android version in July 2020, where it is now known by its current name as Blue Archive. Initially scheduled to be released in 2020, it was later moved to February 4, 2021.<br><br>A worldwide version of the game was announced in August 2021, surpassing one million pre-registrations ahead of its release. The version, which includes English as well as Korean, Traditional Chinese and Thai language support was released on November 8 of the same year by Nexon. On November 11, 2022, Nexon updated the ratings of the worldwide version of the game to \"Mature\" from the original \"Teen\" rating, while released a separate \"Teen\"-rated version of the game, particularly due to its rating issues in Korea. The \"Teen\" rating version has some content changes compared to the original release.<br><br>A Simplified Chinese version of the game for China release has been revealed in works in March 2023, as the Chinese authority released a statement regarding passing of the games to be played in the country. The game website later went live alongside the first preview on March 31, 2023, with pre-registrations are open on the same day. A closed beta test is done between June and July 2023, and on August 3, 2023, the game finally went live in China as an open beta. The Chinese version is published by Yostar.<br><br>In October 2023, Nexon announced that the Global version would be available in the Galaxy Store for Samsung phones. This version was released on October 31.<\/div><div><br><br><br><\/div>",
            "published_at": null,
            "created_at": "2024-05-07 06:48:21",
            "updated_at": "2024-05-07 06:48:21"
        },
        {
            "id": "8",
            "category_id": "5",
            "user_id": "3",
            "title": "Minicraft",
            "slug": "minicraft",
            "image": "post-images\/J9Au7t9srNRL0AfwK8HrOnj0VTA2COmXL8sPvZQZ.webp",
            "excerpt": "Minicraft adalah sebuah permainan bak pasir yang dikembangkan oleh pengembang permainan Swedia Mojang Studios. Permainan ini dibuat oleh Markus \"Notch\" Persson dalam bahasa pemrograman Java. Setelah b...",
            "body": "<div><strong><em><br>Minicraft<\/em><\/strong> adalah sebuah <a href=\"https:\/\/id.wikipedia.org\/wiki\/Permainan_bak_pasir\">permainan bak pasir<\/a> yang dikembangkan oleh pengembang permainan Swedia <a href=\"https:\/\/id.wikipedia.org\/wiki\/Mojang_Studios\">Mojang Studios<\/a>. Permainan ini dibuat oleh <a href=\"https:\/\/id.wikipedia.org\/wiki\/Markus_Persson\">Markus \"Notch\" Persson<\/a> dalam <a href=\"https:\/\/id.wikipedia.org\/wiki\/Java\">bahasa pemrograman Java<\/a>. Setelah beberapa versi pengujian pribadi awal, permainan ini pertama kali diterbitkan pada Mei 2009 sebelum sepenuhnya dirilis pada November 2011, kemudian <a href=\"https:\/\/id.wikipedia.org\/wiki\/Jens_Bergensten\">Jens \"Jeb\" Bergensten<\/a> mengambil alih pengembangan. Permainan ini adalah salah satu yang terlaris sepanjang masa, terjual lebih dari 238 juta kali dan dengan lebih dari 140 juta <a href=\"https:\/\/id.wikipedia.org\/wiki\/Pengguna_aktif\">pemain aktif<\/a> bulanan.<\/div><div><br>Di <em>Minecraft<\/em>, pemain menjelajahi dunia <a href=\"https:\/\/id.wikipedia.org\/wiki\/Grafika_komputer_3D\">3D<\/a> kotak-kotak dengan bioma Minecraft beragam yang dihasilkan secara prosedural, dan dapat menemukan dan membuat dari bahan baku, alat kerajinan, membangun struktur atau pekerjaan tanah, tergantung pada mode permainan, dapat melawan musuh yang dikendalikan oleh komputer, dan juga bekerja sama atau bersaing dengan pemain lain di dunia yang sama. Mode permainan dalam <em>Minecraft<\/em> termasuk mode bertahan hidup, di mana pemain harus mendapatkan sumber daya untuk membangun dunia dan menjaga kesehatan, dan mode kreatif, di mana pemain memiliki sumber daya tanpa batas. Pemain dapat memodifikasi game dengan mod untuk membuat mekanisme, item, tekstur, <em>add-ons<\/em>, dan aset alur permainan baru.<\/div><div><br>Versi-versi awal permainan ini mendapat tanggapan secara positif, memenangkan beberapa penghargaan dan disebut sebagai salah satu permainan video terbaik yang pernah ada. <a href=\"https:\/\/id.wikipedia.org\/wiki\/Sosial_media\">Sosial media<\/a>, parodi, adaptasi, barang dagangan, dan Minecon yang diselenggarakan tiap tahun memiliki peran besar dalam kepopuleran permainan ini. <em>Minecraft<\/em> juga digunakan dalam lingkungan edukasi untuk mengajarkan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Kimia\">kimia<\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/CAD\">CAD<\/a>, dan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Ilmu_komputer\">ilmu komputer<\/a>. Pada 2014, Mojang dan properti intelektual <em>Minecraft<\/em> dibeli Microsoft seharga US$2,5 miliar. Sejumlah game spin-off juga telah dikembangkan, seperti <a href=\"https:\/\/id.wikipedia.org\/w\/index.php?title=Minecraft:_Story_Mode&amp;action=edit&amp;redlink=1\"><em>Minecraft: Story Mode<\/em><\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Minecraft_Earth\"><em>Minecraft Earth<\/em><\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Minecraft_Dungeons\"><em>Minecraft Dungeons<\/em><\/a><em>, dan <\/em><a href=\"https:\/\/id.wikipedia.org\/w\/index.php?title=Minecraft_Legends&amp;action=edit&amp;redlink=1\"><em>Minecraft Legends<\/em><\/a>.<br><br><strong><em>Alur permainan<\/em><\/strong><\/div><div><em>Minecraft<\/em> adalah <a href=\"https:\/\/id.wikipedia.org\/wiki\/Permainan_sandbox\">permainan sandbox<\/a> <a href=\"https:\/\/id.wikipedia.org\/wiki\/3_dimensi\">3D<\/a> yang tidak memiliki tujuan khusus dan jelas untuk dicapai, memungkinkan pemain memiliki kebebasan untuk memilih cara bermain. Namun, permainan ini memiliki sistem achievement (pencapaian) di <em>Bedrock Edition<\/em>, bernama \"advancements\" (kemajuan) di <em>Java Edition<\/em>, dan \"trophies\" (piala) di edisi PlayStation. Permainan ini menggunakan perspektif orang pertama secara default, tetapi pemain dapat mengganti perspektif menjadi perspektif orang ketiga. Dunia permainan ini terdiri objek-objek 3 dimensional—terutama kubus dan cairan, diketahui dengan nama 'block\"—yang melambangkan berbagai material seperti batu, kayu, tanah, dan air. Dalam permainan ini, terdapat juga sebuah material bernama redstone, yang dapat digunakan untuk menggunakan perangkat mekanis primitif, sirkuit listrik, dan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Gerbang_logika\">gerbang logika<\/a> yang memungkinkan dibuatnya sistem yang kompleks.<\/div><div><br>Dunia permainan ini dihasilkan secara prosedural dengan <em>map seed<\/em> yang didapat secara otomatis dari waktu pada sistem (komputer) atau secara manual dimasukkan oleh pemain.<\/div><div><br>Walau batas ada di gerakan vertikal baik atas dan ke bawah, Minecraft memungkinkan untuk dunia permainan besar tak berhingga yang dihasilkan pada bidang horizontal, hanya terjadi permasalahan teknis terjadi ketika lokasi yang sangat jauh tercapai. Permainan ini mencapai dengan memisahkan data menjadi beberapa bagian dunia permainan yang lebih kecil, disebut <em>chunk<\/em> yang hanya dimuat ke memori ketika pemain berada di dekatnya. Setiap <em>chunk<\/em> memiliki ukuran 16 x 256 x 16 (1.17&lt;) atau 16 x 320 x 16 (&gt;1.18) blok.<\/div><div><br>Pemain baru memiliki kulit bawaaan yang dipilih secara acak antara Steve atau Alex, kulit akan dipilh menyesuaikan nama pemain, jika pemain bernama laki-laki akan dipilih Steve, jika pemain bernama perempuan akan dipilih Alex, tetapi jika pemain memiliki angka atau simbol di namanya seperti Player69 atau Player_, permainan akan memlilihnya secara acak, namun pilihan untuk membuat skin yang dibuat sendiri ditambahkan pada 2010. akan bertemu berbagai <a href=\"https:\/\/id.wikipedia.org\/wiki\/Karakter_non-pemain\">karakter non-pemain<\/a> (NPC) yang dikenal dengan sebutan <em>mobs<\/em>, seperti hewan, penduduk desa (<em>villagers<\/em>), dan <em>hostile mobs<\/em>. <em>Passive mobs<\/em> (seperti domba, sapi, ayam, babi, dan kelinci) dapat diburu untuk mendapatkan makanan atau bahan kerajinan. Mereka muncul pada siang hari, sementara <em>hostile mobs<\/em> atau mobs berbahaya (seperti <a href=\"https:\/\/id.wikipedia.org\/wiki\/Zombi\">Zombie<\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Rangka_manusia\">Skeleton<\/a>, Spider, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Creeper\">Creeper<\/a>, Enderman, dan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Slime\">Slime<\/a>) muncul pada malam hari. Beberapa <a href=\"https:\/\/id.wikipedia.org\/wiki\/Mayat_hidup\"><em>undead<\/em><\/a><em> mobs<\/em> seperti <a href=\"https:\/\/id.wikipedia.org\/wiki\/Zombi\">Zombie<\/a>, dan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Rangka_manusia\">Skeleton<\/a> akan terbakar di bawah cahaya matahari. Beberapa mob juga memiliki kemampuan unik seperti <a href=\"https:\/\/id.wikipedia.org\/wiki\/Creeper\">Creeper<\/a> (mob yang dapat meledak) dan Enderman (mob yang dapat teleportasi dan membawa blok).<\/div><div><br>Terdapat 3 jenis dunia yang ada di Minecraft. Pertama adalah <em>Overworld<\/em>, di mana pemain mulai berpetualang dan bertahan hidup pada awalnya. Kedua adalah <em>Nether<\/em>, neraka versi <em>Minecraft<\/em>, sedangkan yang ketiga adalah <em>The End<\/em>, tempat di mana Naga Ender <a href=\"https:\/\/minecraft.fandom.com\/wiki\/Ender_Dragon\">\"Ender Dragon (dalam bahasa Inggris)\"<\/a>. Diakses tanggal 6 September 2021. berada. Setelah mengalahkan Ender Dragon pemain bisa kembali ke alam semesta atau pergi ke End City yaitu tempat tumbuhnya tanaman chorus dan End Ship tempat di mana player mendapatkan Elytra atau semacam sayap yang bisa digunakan player untuk terbang.<\/div><div><br>Minecraft memiliki lima mode permainan dalam edisi Java, yaitu: <em>Survival<\/em>, <em>Creative<\/em>, Adventure, Hardcore,<em>dan Mode Penonton atau <\/em>Spectator<em>. Dan kini edisi Bedrock memiliki empat mode, yaitu: <\/em>Survival<em>, <\/em>Creative<em>, <\/em>Adventure<em>, dan <\/em>Spectator<em>atau mode penonton. Minecraft juga memiliki 4 tingkat kesulitan yang dapat diubah sesuai keinginan yaitu <\/em>Peaceful, Easy, Normal,<em>dan <\/em>Hard<em>.<br><br><\/em><strong><em>Mode Bermain<br><\/em><\/strong><strong><br>Mode Bertahan Hidup<\/strong><\/div><div>Pada mode bertahan hidup (bahasa inggris; <em>survival<\/em>), pemain diharuskan untuk mendapatkan sumber daya alam seperti kayu dan batu untuk membuat blok atau barang tertentu untuk bertahan hidup. Berdasarkan dari tingkat kesulitan yang dipilih, monster (makhluk tak ramah) akan muncul di tempat tempat gelap pada jarak tertentu dari pemain, mengharuskan pemain untuk membuat tempat perlindungan demi dapat bertahan hidup pada malam hari. Pada mode ini juga terdapat Bilah Kesehatan yang dapat berkurang jika terserang oleh monster, jatuh, tenggelam, jatuh ke lava, tercekik, kelaparan, dan beberapa hal lainnya. Pemain juga memiliki Bilah Kelaparan, mengharuskan pemain untuk makan makanan dalam permainan setiap beberapa saat, kecuali pada mode Damai\/Tenang. Jika Bilah Kelaparan berkurang penyembuhan akan berhenti dan jika sampai habis <em>Health Bar<\/em> atau kesehatan pemain akan berkurang secara perlahan. Kesehatan\/Darah pemain akan bertambah jika Bilah Kelaparan penuh atau hampir penuh.<\/div><div><br>Pemain dapat membuat berbagai barang di <em>Minecraft<\/em>. Pemain dapat membuat baju pelindung yang dapat mengurangi efek dari serangan, lalu senjata juga dapat dibuat untuk membunuh musuh dan hewan lebih mudah. Pemain juga dapat membuat peralatan seperti <a href=\"https:\/\/id.wikipedia.org\/wiki\/Kapak\">kapak<\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Beliung\">beliung<\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Cangkul\">cangkul<\/a>, dan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Sekop\">sekop<\/a> yang digunakan untuk menebang pohon, menambang, menggali tanah dan lain lain. Pemain juga dapat membuat tungku pembakaran untuk membakar makanan, hasil tambang dan beberapa material lainnya. Pemain bisa melakukan berdagang dengan penduduk dengan menukarkan zamrud dengan barang lain seperti makanan, blok, benda, ataupun peralatan.<\/div><div><br>Permainan ini memiliki sistem persediaan, di mana pemain dapat membawa barang dalam jumlah terbatas. Ketika pemain mati, barang yang ada pada persediaan akan secara otomatis terjatuh, dan pemain akan hidup kembali di titik bangkit yang secara otomatis disetel di mana pemain berada di awal permainan (ketika memulai dunia pertama kali) dan akan di-reset ketika pemain tidur di tempat tidur (bed). Barang yang jatuh dapat diambil kembali jika pemain dapat meraih barang barang tersebut sebelum barangnya menghilang. Pemain bisa mengumpulkan Poin Pengalaman yang bisa didapatkan dengan membunuh monster\/pemain lain, menambang, membakar hasil tambang, membudidayakan ternak, dan memasak makanan. Pengalaman dapat digunakan untuk meningkatkan peralatan, baju pelindung, dan senjata. Barang yang telah ditingkatkan biasanya lebih kuat, tahan lama, atau memiliki efek spesial lainnya.<\/div><div><br>Singkatnya, mode bertahan hidup adalah mode di mana pemain diharuskan untuk bertahan hidup dari kelaparan dan monster yang akan muncul pada malam hari.<\/div><div><br><strong><br>Mode Kreatif<\/strong><\/div><div>Mode kreatif pertama kali diperkenalkan pada pembaruan Beta 1.8. Pada mode kreatif, pemain memiliki sumber daya, nyawa, dan poin pengalaman tak terhingga. Pemain juga memiliki kemampuan untuk terbang. Makhluk Bermusuhan juga tidak akan menyerang pemain, dan mulai dari pembaruan rilis 1.6 mereka tidak akan menyerang balik jika diserang. Semua balok dapat diletakkan atau dihancurkan dengan sekali pukul.<\/div><div><br>Berbeda dengan mode survival, persediaan memiliki menu yang penuh dengan barang dan balok, memungkinkan pemain untuk menyeret barang\/blok ke persedian-nya.<\/div><div><br>Di sini pemain dibebaskan untuk melakukan apapun seperti membuat kreasi, eksperimen, atau hal yang tidak masuk akal untuk menghilangkan kebosanan. Biasa kebanyakan pemain menggunakan mode ini untuk membuat sebuah kreasi seperti membuat kota, kastil, dan sebagainya.<\/div><div><br>Mode ini menyerupai versi klasik Minecraft, di mana pemain diberikan blok tak terhingga yang membedakannya adalah block dan barang pada versi klasik lebih sedikit dibandingkan dengan versi sekarang.<\/div><div><br><strong><br>Mode Petualangan<\/strong><\/div><div>Mode petualangan pertama kali diperkenalkan pada rilis versi 1.3.1. Pada mode petualangan, pemain hanya dapat menghancurkan block dengan peralatan yang benar, misalnya beliung tidak dapat menghancurkan kayu, kapak tidak dapat menghancurkan tanah, dan sekop tidak menghancurkan batu. Kecuali pada rilis 1.8 pemain tidak dapat menghancurkan block dengan peralatan atau item apapun, pemain bahkan tidak dapat meletakkan block apapun kecuali memiliki <em>NBT<\/em> <em>tag<\/em> (seperti \"Can be placed on ....\", atau \"Can break ....\"). Hal ini membuat <em>custom map<\/em> lebih menantang karena pemain tidak dapat bermain curang. Walaupun begitu pemain masih dapat membunuh <em>mobs<\/em> dengan peralatan\/barang apapun. Mode ini biasa digunakan untuk map custom (yaitu map yang diciptakan untuk kegunaan tertentu seperti minigame, <a href=\"https:\/\/id.wikipedia.org\/wiki\/Bercerita\">story-telling<\/a>, atau lobi <a href=\"https:\/\/id.wikipedia.org\/wiki\/Peladen\">peladen<\/a>), dengan tujuan agar pemain tidak menghancurkan block sembarangan.<\/div><div><br><strong><br>Mode Hardcore<\/strong><\/div><div>Mode Hardcore adalah mode survival dengan tingkat kesulitan tertinggi, dan pemain hanya memiliki satu nyawa. Ketika pemain mati akan muncul tombol \"Delete World\" daripada tombol \"Respawn\" dan \"Main Menu\" yang muncul. Namun, pada pembaruan 1.9 selain tombol \"Delete World\" ada juga tombol yang memungkinkan pemain untuk masuk ke <em>mode Penonton<\/em> untuk melihat lihat dunianya sekali lagi. Dunianya tidak akan otomatis dihapus, secara teknis file dunia tersebut masih tersimpan hingga pemain menekan tombol \"Delete World\".<\/div><div><br>Pemain juga dapat membuat mode ini lebih menantang dengan membuatnya menjadi \"<em>Ultra-Hardcore Survival<\/em>\" yaitu minigame di mana <em>health bar<\/em> pemain tidak akan pulih secara alami.<\/div><div><br>Mode permainan ini hanya dapat diakses dalam edisi Java atau PC.<\/div><div><br><strong><br>Mode Spectator<\/strong><\/div><div>Mode Spectator memungkinkan pemain untuk terbang melalui blok dan menonton permainan tanpa berinteraksi langsung. Pemain tidak memiliki inventaris, tetapi dapat berteleportasi ke pemain lain dan melihat dari perspektif pemain atau makhluk lain. Dalam Minecraft edisi Java, terdapat beberapa mob yang memiliki penglihatan khusus, yaitu Enderman, Creeper dan Laba-laba. Mode permainan ini hanya dapat diakses dalam edisi Java maupun Bedrock.<\/div><div><br><strong><br>Multipemain<\/strong><\/div><div>Multipemain di Minecraft tersedia melalui multipemain game-to-game langsung, bermain LAN, layar split lokal, dan server (host pemain dan host-bisnis). Ini memungkinkan banyak pemain untuk berinteraksi dan berkomunikasi satu sama lain di satu world. Pemain dapat menjalankan server mereka sendiri, menggunakan penyedia hosting, atau terhubung langsung ke game pemain lain melalui Xbox Live. Dunia pemain tunggal memiliki dukungan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Jaringan_area_lokal\">jaringan area lokal<\/a>, memungkinkan pemain untuk bergabung dengan dunia pada komputer yang saling terhubung secara lokal tanpa pengaturan peladen. Peladen multipemain Minecraft dipandu oleh operator peladen, yang memiliki akses ke perintah peladen seperti mengatur waktu hari dan memindahkan pemain. Operator juga dapat menetapkan batasan tentang nama pengguna atau <a href=\"https:\/\/id.wikipedia.org\/wiki\/Alamat_IP\">alamat IP<\/a> mana yang diizinkan atau tidak diizinkan masuk ke server.<\/div><div><br>Peladen multipemain sangat beragam, banyak yang memiliki peraturan dan kebiasaaannya sendiri. Server yang paling besar dan populer di dunia adalah <a href=\"https:\/\/id.wikipedia.org\/wiki\/Hypixel\">Hypixel<\/a>, yang sudah dikunjungi 14 juta pemain atau yang terpopuler di <a href=\"https:\/\/id.wikipedia.org\/wiki\/Indonesia\">Indonesia<\/a> adalah Crazy Network dan Block Craft. Ada juga pertarungan player versus player (PvP) yang memungkinkan pertarungan antar pemain.<\/div><div><br><strong><br>Minecraft Realms<\/strong><\/div><div>Pada 2013, Mojang mengumumkan <em>Minecraft Realms<\/em>, sebuah layanan hosting peladen yang dimaksudkan untuk memungkinkan pemain menjalankan game multipemain server dengan mudah dan aman tanpa harus membuat sendiri. Hanya pemain yang diundang yang dapat bergabung dengan server Realms, dan server ini tidak menggunakan alamat IP. Pemilik server <em>Minecraft: Java Edition Realms<\/em> dapat mengundang hingga dua puluh orang untuk bermain di server mereka, dengan hingga sepuluh pemain online bersamaan. Pemilik server <em>Minecraft<\/em> Realms dapat mengundang hingga 3000 orang untuk bermain di server mereka, dengan hingga sepuluh pemain online pada satu waktu. Server Realms <em>Minecraft: Java Edition<\/em> tidak mendukung plugin buatan pengguna, tetapi pemain dapat memainkan map <em>Minecraft<\/em> khusus. Server <em>Minecraft<\/em> Realms mendukung add-ons buatan pengguna, paket sumber daya, paket perilaku, dan peta <em>Minecraft<\/em> khusus. Di <a href=\"https:\/\/id.wikipedia.org\/w\/index.php?title=Electronic_Entertainment_Expo_2016&amp;action=edit&amp;redlink=1\">Electronic Entertainment Expo 2016<\/a>, diumumkan bahwa Realms akan memungkinkan dapat dimainkan <a href=\"https:\/\/id.wikipedia.org\/w\/index.php?title=Permainan_antar-platform&amp;action=edit&amp;redlink=1\">permainan antar-platform<\/a> antara <a href=\"https:\/\/id.wikipedia.org\/wiki\/Windows_10\">Windows 10<\/a>, <a href=\"https:\/\/id.wikipedia.org\/wiki\/IOS\">iOS<\/a>, dan platform <a href=\"https:\/\/id.wikipedia.org\/wiki\/Android\">Android<\/a> mulai Juni 2016, dengan dukungan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Xbox_One\">Xbox One<\/a> dan <a href=\"https:\/\/id.wikipedia.org\/wiki\/Nintendo_Switch\">Nintendo Switch<\/a> yang akan datang kemudian pada 2017, dan dukungan untuk perangkat <a href=\"https:\/\/id.wikipedia.org\/wiki\/Realitas_virtual\">realitas virtual<\/a>. Pada tanggal 31 Juli 2017, Mojang merilis versi beta dari pembaruan yang memungkinkan permainan lintas platform. Dukungan Nintendo Switch untuk Realm dirilis pada Juli 2018.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 07:57:52",
            "updated_at": "2024-05-07 08:35:03"
        },
        {
            "id": "9",
            "category_id": "4",
            "user_id": "2",
            "title": "Lenovo Legion Slim 5 Gen 8 (16\" AMD)",
            "slug": "lenovo-legion-slim-5-gen-8-16-amd",
            "image": "post-images\/eh8qcn2eBtXOP421s3mco609DRZEKJUfISdkd2n9.jpg",
            "excerpt": "Legion Slim 5 Gen 8 (16″ AMD) Gaming LaptopThe World’s Most Portable 16″ AI-tuned Gaming Laptops*Push gameplay beyond performance with AMD Ryzen™ 7000 series processorsNVIDIA® GeForce RTX™ 40 Series L...",
            "body": "<h1>Legion Slim 5 Gen 8 (16″ AMD) Gaming Laptop<\/h1><div><br><br>The World’s Most Portable 16″ AI-tuned Gaming Laptops*<br><br><\/div><ul><li>Push gameplay beyond performance with AMD Ryzen™ 7000 series processors<\/li><li>NVIDIA® GeForce RTX™ 40 Series Laptop GPUs offer new ways to create &amp; ultimate speed<\/li><li>Beat the competition with AI-tuned performance via Lenovo AI Engine+ with LA1 AI chip.<\/li><li>Lenovo Legion ColdFront 5.0 thermal technology keeps things chill, smooth &amp; whisper-quiet<\/li><li>Massive 16″ 16:10 Lenovo PureSight gaming display with true-to-life colors, lightning-fast refresh rate<\/li><\/ul><div><strong>PERFORMANCE<\/strong><\/div><div><strong>Processor<\/strong> | AMD Ryzen™ 5 7640HS Processor (4.30 GHz, up to 5.00 GHz Max Boost, 6 Cores, 12 Threads, 16 MB Cache)AMD Ryzen™ 7 7840HS Processor (3.80 GHz, up to 5.10 GHz Max Boost, 8 Cores, 16 Threads, 16 MB Cache)<br><strong>Operating System<\/strong> | Windows 11 Home<br><strong>Graphics<\/strong> | NVIDIA® GeForce RTX™ 4050 Laptop GPU 6GB GDDR6<br>NVIDIA® GeForce RTX™ 4060 Laptop GPU 8GB GDDR6<br><strong>Memory<\/strong> | 16GB (2 x 8GB) 5600Mhz DDR5<br>Disclaimer: Maximum supported memory speed may vary and is contingent on the processor.<br><strong>Storage<\/strong> | Up to 1TB PCIe SSD Gen 4<br><br><\/div><div><strong>FEATURES<br>Speed meets endurance with AMD Ryzen™ processors<\/strong><\/div><div>Speed meets endurance when you play with a gaming laptop powered by AMD Ryzen™ processors. Seize the pure performance you need to win, without compromising battery life.<br><br><strong>Fully powered NVIDIA® GeForce RTX™ graphics cards. Beyond fast.<\/strong><\/div><div>NVIDIA® GeForce RTX™ 40 Series Laptop GPUs power the world’s fastest laptops for gamers and creators. Built with the ultra-efficient NVIDIA® Ada Lovelace architecture, they bring a quantum leap in performance with AI-powered DLSS 3, and enable lifelike virtual worlds with full ray tracing. Plus, the NVIDIA suite of technologies optimizes system performance, power, battery life, and acoustics for peak efficiency.<br><br><strong>Play over 100 high-quality PC games with your new Lenovo Legion &amp; three months of Xbox Game Pass<\/strong><\/div><div>Play over 100 high-quality games with your new PC and 3 months of Xbox Game Pass-including EA Play. With new games added all the time, there's always something new to play. Download and play in full fidelity or play console games from the cloud with connected controller. Details at <a href=\"https:\/\/www.xbox.com\/gamepass\">xbox.com\/gamepass<\/a>.<\/div><div><br><strong>Thermal innovations unleashed<\/strong><\/div><div>Thermal throttling? Not on our watch! The Lenovo Legion Slim 5 Gen 8 includes all of the advanced cooling features you need to dominate the competition, and create graphics-intensive masterpieces. With our Legion ColdFront 5.0 technology featuring up to 160W thermal design power, you’ll be able to stay on top of your gaming without having to worry about overheating. Get ready to feel the chill with a phase change thermal compound, massively larger hybrid copper heat pipes, improved air intake and exhaust, and a powerful 12V dual liquid crystal polymer fan system. Plus, with performance mode, your system can stay under 48db.<br><br><strong>Thermal innovations unleashed<\/strong><\/div><div>Thermal throttling? Not on our watch! The Lenovo Legion Slim 5 Gen 8 includes all of the advanced cooling features you need to dominate the competition, and create graphics-intensive masterpieces. With our Legion ColdFront 5.0 technology featuring up to 160W thermal design power, you’ll be able to stay on top of your gaming without having to worry about overheating. Get ready to feel the chill with a phase change thermal compound, massively larger hybrid copper heat pipes, improved air intake and exhaust, and a powerful 12V dual liquid crystal polymer fan system. Plus, with performance mode, your system can stay under 48db.<\/div><div><br><strong>Gear up for gameplay &amp; content creation<\/strong><\/div><div>Get ready for pro-level gameplay and content creation with the Lenovo Legion Slim 5 laptop's 16″ WQXGA Lenovo PureSight Gaming display with a 16:10 aspect ratio. This large screen boasts up to a lightning-fast 165Hz refresh rate, NVIDIA® G-SYNC®, and AMD FreeSync™ Premium support for ultra-smooth gameplay. Plus, its 100% sRGB color accuracy, 300 nits of brightness, and Dolby Vision® HDR support deliver crystal-clear visuals. And with X-rite technology, you'll get a remarkable wide and accurate color gamut and massive resolution to fully immerse yourself in your gameplay or content canvas.<br><br><strong>Tap into serious battery power<\/strong><\/div><div>Blessed with a monstrous power supply and backed by lightning-fast charging speeds, the Lenovo Legion Slim 5 features an 80Whr battery. With Super Rapid Charge technology, get a 70% charge in just 30 minutes, or 100% in a mere 80 minutes with optional USB-C charging up to 140W*. Additionally, the smart battery 3.0 ensures long-lasting power during gaming and creative sessions, while also maintaining the health of the battery.<br><strong><br>True, precise strikes<\/strong><\/div><div>Whether you’re gaming or creating, unleash pure precision with the epic Lenovo Legion TrueStrike keyboard featuring a massive mylar trackpad, numpad, and full-sized arrow keys. With a 1.5mm travel distance, the Lenovo Legion Slim 5 laptop’s keyboard offers a smooth key press, as well as customizable keycaps for a personalized touch. Plus, you can add extra flair to your setup with Legion Spectrum 4-zone RGB lighting.<br><br><strong>Nahimic® Audio by SteelSeries for gamers, immersive 3D audio<\/strong><\/div><div>Nahimic by SteelSeries drastically improves your gaming experience by providing unprecedented immersive 3D audio designed for gamers. Experience crystal-clear communication with your teammates, allowing you to use a simple way of mixing and sharing audio streaming journeys like a professional streamer. Nahimic doesn’t just let you play your games - it lets you live it.<br><br><strong>Legion Ultimate Support<\/strong><\/div><div>Legion Ultimate Support is here to be your META – Most Effective Tactic Available. With one point of contact, you get 24\/7 gamer-centric support from a team of IT and gaming experts who can help you optimize your hardware and software settings. Legion Ultimate Support pros will keep you productive through the day and unbeatable at night.<br><br><br><\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:09:13",
            "updated_at": "2024-05-07 08:28:10"
        },
        {
            "id": "10",
            "category_id": "3",
            "user_id": "1",
            "title": "Review Anime Selection Project",
            "slug": "review-anime-selection-project",
            "image": "post-images\/bQ82e9tX9WiTEvcZO1BR3dyhR0RhAPdP8x883zNq.png",
            "excerpt": " Selection Project bercerita tentang Suzune Miyama, seorang gadis yang telah sakit sejak kecil, dia selalu mendengarkan musik dari Idol Akari Amasawa untuk meningkatkan semangat serta senyumnya dimasa...",
            "body": "<div> <\/div><div>Selection Project bercerita tentang Suzune Miyama, seorang gadis yang telah sakit sejak kecil, dia selalu mendengarkan musik dari Idol Akari Amasawa untuk meningkatkan semangat serta senyumnya dimasa-masa sulit tersebut. Beberapa waktu berlalu, Suzune telah tumbuh menjadi gadis yang penuh semangat dan telah berada di kelas 3 SMP, dan saat ini sedang mengikuti audisi menjadi salah satu dari sembilan Idola terpilih dalam “Selection Project”, dimana itu adalah kompetisi yang pernah diikuti Akari Amasawa untuk menjadi Idol terkenal. Apakah Suzune mampu mengikuti jejak idolanya?<\/div><div><br><\/div><div>Selection Project merupakan serial yang menarik dengan perkembangan yang cukup unik, dimana di episode pertama kita melihat kegagalan salah satu karakter utama, dan di episode selanjutnya disediakan perkembangan yang tidak terduga bahkan bisa disebut curang, tetapi anehnya hal itu malah membuat tujuan dari karakter semakin kuat. Selain itu juga, tersedianya konsep cerita yang unik, dimana kita diperlihatkan sekumpulan gadis muda yang ingin menjadi idol dengan konsep kompetisi yang modern.<br><br><\/div><div>Di awalan ceritanya ini, sebenarnya kita hanya terfokus kepada apa yang ingin serial ini sajikan, seperti para karakter utama yang berisikan para gadis dengan berbagai keunikan, kemudian konsep idol yang ingin serial ini sajikan, hingga kepada tujuan dari karakter utama. Melihat hal ini, sebenarnya ini termasuk yang baru untuk serial anime, tetapi untuk budaya Idol Jepang sendiri ini termasuk yang telah ada cukup lama. Namun, meskipun begitu ini mengartikan bahwa serial ini ingin menyediakan cerita yang sangat dekat dengan budaya Idol aslinya, dan sejujurnya ini termasuk yang menarik untuk kita tonton.<br><br><\/div><div>Pada serial ini, sebenarnya yang paling terasa unik serta berbeda adalah soal kompetisi yang disajikan di serial ini termasuk yang modern, dimana kita disajikan konsep seleksi dari para idol dengan disediakan teknologi yang membuat penggemar memilih sendiri siapa yang paling bagus penampilannya. Selain itu juga, karena kompetisi yang disajikan menjadi judul dari serial ini, maka bukan hal yang aneh jikalau kompetisi ini menjadi hal yang paling unik serta dapat menjadi pembeda dengan serial idol pada umumnya.<br> <\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:10:36",
            "updated_at": "2024-05-07 09:17:03"
        },
        {
            "id": "11",
            "category_id": "2",
            "user_id": "3",
            "title": "Personal Computer (pc)",
            "slug": "personal-computer-pc",
            "image": "post-images\/LkZa2gW1u0nKyfLdsnkUq1C023otsFeKNRdHr0yp.jpg",
            "excerpt": "Komputer pribadi, sering disebut sebagai PC, adalah komputeryang dirancang untuk penggunaan individu. Biasanya digunakan untuk tugas-tugas seperti pengolah kata, penelusuran internet, email, pemutaran...",
            "body": "<div><br>Komputer <strong>pribadi<\/strong>, sering disebut sebagai <strong>PC<\/strong>, adalah <a href=\"https:\/\/en.wikipedia.org\/wiki\/Computer\">komputer<\/a>yang dirancang untuk penggunaan individu. Biasanya digunakan untuk tugas-tugas seperti <a href=\"https:\/\/en.wikipedia.org\/wiki\/Word_processing\">pengolah kata<\/a>, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Web_browser\">penelusuran internet<\/a>, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Email\">email<\/a>, pemutaran <a href=\"https:\/\/en.wikipedia.org\/wiki\/Multimedia\">multimedia<\/a>, dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/PC_game\">bermain game<\/a>. Komputer pribadi dimaksudkan untuk dioperasikan secara langsung oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/End_user\">pengguna akhir<\/a>, bukan oleh ahli atau <a href=\"https:\/\/en.wikipedia.org\/wiki\/Technician\">teknisi<\/a>komputer . Tidak seperti <a href=\"https:\/\/en.wikipedia.org\/wiki\/Minicomputer\">komputer mini<\/a>dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Mainframe_computer\">mainframe<\/a>yang besar dan mahal , <a href=\"https:\/\/en.wikipedia.org\/wiki\/Time-sharing\">pembagian waktu<\/a>oleh banyak orang pada saat yang sama tidak digunakan pada komputer pribadi. Istilah <a href=\"https:\/\/en.wikipedia.org\/wiki\/Home_computer\">komputer rumahan<\/a>juga telah digunakan, terutama pada akhir tahun 1970an dan 1980an. Munculnya komputer pribadi dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Digital_Revolution\">Revolusi Digital<\/a>yang terjadi secara bersamaan telah memberikan dampak signifikan terhadap kehidupan masyarakat di semua negara.<\/div><div><br>Pemilik komputer institusi atau perusahaan pada tahun 1960an harus menulis program mereka sendiri untuk melakukan pekerjaan yang berguna dengan komputer. Meskipun pengguna komputer pribadi dapat mengembangkan aplikasi mereka, biasanya sistem ini menjalankan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Commercial_software\">perangkat lunak komersial<\/a>, perangkat lunak bebas biaya (“ <a href=\"https:\/\/en.wikipedia.org\/wiki\/Freeware\">freeware<\/a>”), yang paling sering merupakan perangkat lunak berpemilik, atau <a href=\"https:\/\/en.wikipedia.org\/wiki\/Free_and_open-source_software\">perangkat lunak bebas dan sumber terbuka<\/a>, yang disediakan dalam “siap pakai”. -run\", atau bentuk <a href=\"https:\/\/en.wikipedia.org\/wiki\/Machine_code\">biner<\/a>. Perangkat lunak untuk komputer pribadi biasanya dikembangkan dan didistribusikan secara independen dari produsen perangkat keras atau <a href=\"https:\/\/en.wikipedia.org\/wiki\/Operating_system\">sistem operasi<\/a>. Banyak pengguna komputer pribadi tidak perlu lagi menulis program mereka untuk menggunakan komputer pribadi, meskipun pemrograman pengguna akhir masih dapat dilakukan. Hal ini berbeda dengan sistem seluler, di mana perangkat lunak seringkali hanya tersedia melalui saluran yang didukung produsen, dan pengembangan program pengguna akhir mungkin terhambat karena kurangnya dukungan dari produsen. <\/div><div><br>Sejak awal tahun 1990-an, sistem operasi <a href=\"https:\/\/en.wikipedia.org\/wiki\/Microsoft\">Microsoft<\/a>(pertama dengan <a href=\"https:\/\/en.wikipedia.org\/wiki\/MS-DOS\">MS-DOS<\/a>dan kemudian dengan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Microsoft_Windows\">Windows<\/a>) dan perangkat keras <a href=\"https:\/\/en.wikipedia.org\/wiki\/Intel\">Intel<\/a>– yang secara kolektif disebut \" <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wintel\">Wintel<\/a>\" – telah mendominasi pasar komputer pribadi, dan saat ini istilah \"PC\" biasanya mengacu pada platform Wintel yang ada di mana-mana. . Alternatif untuk Windows menempati pangsa pasar minoritas; ini termasuk platform <a href=\"https:\/\/en.wikipedia.org\/wiki\/Mac_(computer)\">Mac<\/a>dari <a href=\"https:\/\/en.wikipedia.org\/wiki\/Apple_Inc.\">Apple<\/a>(menjalankan sistem operasi <a href=\"https:\/\/en.wikipedia.org\/wiki\/MacOS\">macOS<\/a>), dan sistem operasi <a href=\"https:\/\/en.wikipedia.org\/wiki\/Unix-like\">mirip Unix yang <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Free_and_open-source_software\">gratis dan bersumber terbuka<\/a>, seperti <a href=\"https:\/\/en.wikipedia.org\/wiki\/Linux\">Linux<\/a>. Platform penting lainnya hingga tahun 1990an adalah <a href=\"https:\/\/en.wikipedia.org\/wiki\/Amiga\">Amiga<\/a>dari <a href=\"https:\/\/en.wikipedia.org\/wiki\/Commodore_International\">Commodore<\/a>, dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/PC-98\">PC-98<\/a>dari <a href=\"https:\/\/en.wikipedia.org\/wiki\/NEC\">NEC<\/a>.<br><br><br><strong><em>Terminologi <\/em><\/strong><\/div><div>Istilah \"PC\" merupakan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Initialism\">inisialisme<\/a>untuk \"komputer pribadi\". Meskipun <a href=\"https:\/\/en.wikipedia.org\/wiki\/IBM_Personal_Computer\">IBM Personal Computer<\/a>memasukkan sebutan tersebut ke dalam nama modelnya, istilah tersebut awalnya menggambarkan komputer pribadi merek apa pun. Dalam beberapa konteks, \"PC\" digunakan sebagai kontras dengan \"Mac\", komputer <a href=\"https:\/\/en.wikipedia.org\/wiki\/Mac_(computer)\">Apple Macintosh<\/a>. <\/div><div><br>Karena tidak satu pun dari produk Apple ini yang merupakan mainframe atau sistem pembagian waktu, semuanya adalah \"komputer pribadi\" dan bukan komputer \"PC\" (merek). Pada tahun 1995, segmen CBS tentang semakin populernya PC melaporkan: \"Bagi banyak pendatang baru, PC adalah singkatan dari Pain and Confusion.\"<br><br><strong><em>Sejarah<\/em><\/strong><br>Dalam <a href=\"https:\/\/en.wikipedia.org\/wiki\/History_of_computing\">sejarah komputasi<\/a>, mesin eksperimental awal dapat dioperasikan oleh satu petugas. Misalnya, <a href=\"https:\/\/en.wikipedia.org\/wiki\/ENIAC\">ENIAC<\/a>yang mulai beroperasi pada tahun 1946 dapat dijalankan oleh satu orang, meskipun sangat terlatih. Mode ini mendahului pemrograman batch, atau mode pembagian waktu dengan banyak pengguna yang terhubung melalui <a href=\"https:\/\/en.wikipedia.org\/wiki\/Computer_terminal\">terminal<\/a>ke komputer mainframe. Komputer yang dimaksudkan untuk keperluan laboratorium, instrumentasi, atau teknik dibuat, dan dapat dioperasikan oleh satu orang secara interaktif. Contohnya termasuk sistem seperti <a href=\"https:\/\/en.wikipedia.org\/wiki\/Bendix_G15\">Bendix G15<\/a>dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/LGP-30\">LGP-30<\/a>tahun 1956, dan komputer seri <a href=\"https:\/\/en.wikipedia.org\/wiki\/MIR_(computer)\">MIR Soviet yang dikembangkan dari tahun 1965 hingga 1969. <\/a>[ <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wikipedia:Citation_needed\"><em>rujukan?<\/em><\/a>]Pada awal tahun 1970-an, orang-orang di lembaga akademis atau penelitian memiliki kesempatan untuk melakukan satu orang penggunaan <a href=\"https:\/\/en.wikipedia.org\/wiki\/LINC\">sistem komputer<\/a>dalam mode interaktif untuk jangka waktu yang lama, meskipun sistem ini masih terlalu mahal untuk dimiliki oleh satu orang.<\/div><div><br>Komputer pribadi dimungkinkan oleh kemajuan besar dalam teknologi <a href=\"https:\/\/en.wikipedia.org\/wiki\/Semiconductor\">semikonduktor<\/a>. Pada tahun 1959, chip <a href=\"https:\/\/en.wikipedia.org\/wiki\/Integrated_circuit\">sirkuit terintegrasi <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Silicon\">silikon<\/a> (IC) dikembangkan oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/Robert_Noyce\">Robert Noyce<\/a>di <a href=\"https:\/\/en.wikipedia.org\/wiki\/Fairchild_Semiconductor\">Fairchild Semiconductor<\/a>, dan transistor <a href=\"https:\/\/en.wikipedia.org\/wiki\/Metal%E2%80%93oxide%E2%80%93semiconductor\">logam-oksida-semikonduktor<\/a>(MOS) dikembangkan oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/Mohamed_Atalla\">Mohamed Atalla<\/a>dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Dawon_Kahng\">Dawon Kahng<\/a>di <a href=\"https:\/\/en.wikipedia.org\/wiki\/Bell_Labs\">Bell Labs<\/a>. Sirkuit terintegrasi MOS dikomersialkan oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/RCA\">RCA<\/a>pada tahun 1964, dan kemudian sirkuit terintegrasi MOS <a href=\"https:\/\/en.wikipedia.org\/wiki\/Silicon-gate\">gerbang silikon<\/a>dikembangkan oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/Federico_Faggin\">Federico Faggin<\/a>di Fairchild pada tahun 1968. Faggin kemudian menggunakan teknologi MOS gerbang silikon untuk mengembangkan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Microprocessor\">mikroprosesor<\/a>chip tunggal pertama , <a href=\"https:\/\/en.wikipedia.org\/wiki\/Intel_4004\">Intel 4004<\/a>, pada tahun 1971. <a href=\"https:\/\/en.wikipedia.org\/wiki\/Microcomputer\">Mikrokomputer<\/a>pertama , berdasarkan mikroprosesor, dikembangkan pada awal tahun 1970-an. Ketersediaan mikroprosesor secara komersial yang luas, sejak pertengahan tahun 1970an dan seterusnya, menjadikan komputer cukup murah untuk dimiliki oleh usaha kecil dan individu.<\/div><div><br>Dalam apa yang kemudian disebut sebagai <a href=\"https:\/\/en.wikipedia.org\/wiki\/The_Mother_of_All_Demos\">Mother of All Demos<\/a>, peneliti <a href=\"https:\/\/en.wikipedia.org\/wiki\/SRI_International\">SRI <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Douglas_Engelbart\">Douglas Engelbart<\/a>pada tahun 1968 memberikan pratinjau fitur-fitur yang nantinya akan menjadi kebutuhan pokok komputer pribadi: <a href=\"https:\/\/en.wikipedia.org\/wiki\/E-mail\">email<\/a>, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Hypertext\">hypertext<\/a>, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Word_processing\">pengolah kata<\/a>, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Video_conferencing\">konferensi video<\/a>, dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Computer_mouse\">mouse<\/a>. Demonstrasi tersebut memerlukan staf pendukung teknis dan komputer mainframe time-sharing yang terlalu mahal untuk penggunaan bisnis individu pada saat itu.<\/div><div><br>Komputer pribadi awal‍—‌umumnya disebut mikrokomputer‍—‌sering dijual dalam bentuk dan dalam jumlah terbatas, dan sebagian besar diminati oleh para penghobi dan teknisi. Pemrograman minimal dilakukan dengan sakelar sakelar untuk memasukkan instruksi, dan keluaran disediakan oleh lampu <a href=\"https:\/\/en.wikipedia.org\/wiki\/Front_panel\">panel depan<\/a>. Penggunaan praktisnya memerlukan penambahan periferal seperti keyboard, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Computer_display\">display komputer<\/a>, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Disk_drive\">disk drive<\/a>, dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Printer_(computing)\">printer<\/a>.<\/div><div><a href=\"https:\/\/en.wikipedia.org\/wiki\/Micral\"><br>Micral N<\/a>adalah komputer mikro komersial non-kit paling awal yang berbasis pada mikroprosesor, Intel <a href=\"https:\/\/en.wikipedia.org\/wiki\/Intel_8008\">8008<\/a>. Dibangun mulai tahun 1972, dan terjual beberapa ratus unit. Hal ini telah didahului oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/Datapoint_2200\">Datapoint 2200<\/a>pada tahun 1970, yang mana Intel 8008 telah ditugaskan, meskipun tidak diterima untuk digunakan. Desain CPU yang diimplementasikan pada Datapoint 2200 menjadi dasar <a href=\"https:\/\/en.wikipedia.org\/wiki\/Instruction_set_architecture\">arsitektur <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/X86\">x86 <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Personal_computer#cite_note-Weidendorfer_2011-18\">[18]<\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/IBM_PC\">yang digunakan pada PC IBM<\/a>asli dan turunannya. <\/div><div><br>Pada tahun 1973, <a href=\"https:\/\/en.wikipedia.org\/wiki\/IBM\">IBM<\/a>Los Gatos Scientific Center mengembangkan prototipe <a href=\"https:\/\/en.wikipedia.org\/wiki\/Portable_computer\">komputer portabel<\/a>yang disebut SCAMP (Special Computer APL Machine Portable) berdasarkan prosesor <a href=\"https:\/\/en.wikipedia.org\/wiki\/IBM_PALM_processor\">IBM PALM<\/a>dengan drive kaset kompak <a href=\"https:\/\/en.wikipedia.org\/wiki\/Philips\">Philips , <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Cathode_ray_tube\">CRT<\/a>kecil , dan keyboard fungsi penuh. SCAMP meniru komputer mini <a href=\"https:\/\/en.wikipedia.org\/wiki\/IBM_1130\">IBM 1130<\/a>untuk menjalankan APL\/1130. Pada tahun 1973, <a href=\"https:\/\/en.wikipedia.org\/wiki\/APL_(programming_language)\">APL<\/a>umumnya hanya tersedia pada komputer mainframe, dan sebagian besar komputer mikro berukuran desktop seperti <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wang_2200\">Wang 2200<\/a>atau <a href=\"https:\/\/en.wikipedia.org\/wiki\/HP_9800_series\">HP 9800<\/a>hanya menawarkan <a href=\"https:\/\/en.wikipedia.org\/wiki\/BASIC\">BASIC<\/a>. Karena SCAMP adalah yang pertama meniru kinerja APL\/1130 pada komputer portabel dan pengguna tunggal, <a href=\"https:\/\/en.wikipedia.org\/wiki\/PC_Magazine\"><em>PC Magazine<\/em><\/a>pada tahun 1983 menyebut SCAMP sebagai \"konsep revolusioner\" dan \"komputer pribadi pertama di dunia\". <a href=\"https:\/\/en.wikipedia.org\/wiki\/Portable_computer\">Komputer portabel<\/a> pengguna tunggal yang penting ini sekarang berada di <a href=\"https:\/\/en.wikipedia.org\/wiki\/Smithsonian_Institution\">Smithsonian Institution<\/a>, Washington, DC. Demonstrasi yang sukses dari prototipe SCAMP tahun 1973 menghasilkan mikrokomputer portabel <a href=\"https:\/\/en.wikipedia.org\/wiki\/IBM_5100\">IBM 5100<\/a>yang diluncurkan pada tahun 1975 dengan kemampuan untuk diprogram dalam APL dan BASIC untuk para insinyur, analis, ahli statistik, dan pemecah masalah bisnis lainnya. Pada akhir tahun 1960-an, mesin seperti itu berukuran hampir sebesar dua meja dan beratnya sekitar setengah ton. <\/div><div><br>Mesin APL portabel desktop lainnya, <a href=\"https:\/\/en.wikipedia.org\/wiki\/MCM\/70\">MCM\/70<\/a>, didemonstrasikan pada tahun 1973 dan dikirimkan pada tahun 1974. Mesin ini menggunakan prosesor <a href=\"https:\/\/en.wikipedia.org\/wiki\/Intel_8008\">Intel 8008<\/a>.<\/div><div><br>Sebuah langkah penting dalam komputasi personal adalah <a href=\"https:\/\/en.wikipedia.org\/wiki\/Xerox_Alto\">Xerox Alto<\/a>tahun 1973 , yang dikembangkan di Pusat <a href=\"https:\/\/en.wikipedia.org\/wiki\/PARC_(company)\">Penelitian Palo Alto (PARC) <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Xerox\">Xerox<\/a>. Itu memiliki antarmuka pengguna grafis ( <a href=\"https:\/\/en.wikipedia.org\/wiki\/GUI\">GUI<\/a>) yang kemudian menjadi inspirasi bagi Apple <a href=\"https:\/\/en.wikipedia.org\/wiki\/Macintosh\">Macintosh<\/a>, dan sistem operasi Microsoft <a href=\"https:\/\/en.wikipedia.org\/wiki\/Windows\">Windows<\/a>. Alto adalah proyek percontohan, tidak dikomersialkan, karena suku cadangnya terlalu mahal untuk terjangkau. <\/div><div><br>Juga pada tahun 1973 <a href=\"https:\/\/en.wikipedia.org\/wiki\/HP_9800_series\">Hewlett Packard<\/a>memperkenalkan mikrokomputer basic yang sepenuhnya dapat diprogram dan ditempatkan seluruhnya di atas meja, termasuk keyboard, layar satu baris kecil, dan printer. Komputer mikro <a href=\"https:\/\/en.wikipedia.org\/wiki\/Wang_2200\">Wang 2200 tahun 1973 memiliki <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Cathode_ray_tube\">tabung sinar katoda<\/a>(CRT) ukuran penuh dan penyimpanan kaset. Ini umumnya merupakan komputer khusus yang mahal yang dijual untuk keperluan bisnis atau ilmiah.<br><br><br>Tahun 1974 diperkenalkan apa yang dianggap oleh banyak orang sebagai \"komputer pribadi\" pertama yang sebenarnya, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Altair_8800\">Altair 8800<\/a>yang dibuat oleh <a href=\"https:\/\/en.wikipedia.org\/wiki\/Micro_Instrumentation_and_Telemetry_Systems\">Micro Instrumentation and Telemetry Systems (MITS)<\/a>. Berdasarkan Mikroprosesor <a href=\"https:\/\/en.wikipedia.org\/wiki\/Intel_8080\">Intel 8080<\/a>8-bit , Altair dikenal luas sebagai percikan yang memicu <a href=\"https:\/\/en.wikipedia.org\/wiki\/Microcomputer_revolution\">revolusi komputer mikro<\/a>, sebagai komputer pribadi pertama yang sukses secara komersial. Bus <a href=\"https:\/\/en.wikipedia.org\/wiki\/Computer_bus\">komputer<\/a>yang dirancang untuk Altair menjadi <a href=\"https:\/\/en.wikipedia.org\/wiki\/De_facto_standard\">standar <em>de facto<\/em><\/a>dalam bentuk <a href=\"https:\/\/en.wikipedia.org\/wiki\/S-100_bus\">bus S-100<\/a>, dan bahasa pemrograman pertama untuk mesin tersebut adalah produk pendiri Microsoft, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Altair_BASIC\">Altair BASIC<\/a>. <\/div><div><br>Pada tahun 1976, <a href=\"https:\/\/en.wikipedia.org\/wiki\/Steve_Jobs\">Steve Jobs<\/a>dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Steve_Wozniak\">Steve Wozniak<\/a>menjual papan sirkuit komputer Apple, yang telah disiapkan sepenuhnya dan berisi sekitar 30 chip. Komputer Apple I berbeda dari komputer hobi bergaya kit lainnya pada zamannya. Atas permintaan Paul<a href=\"https:\/\/en.wikipedia.org\/wiki\/Paul_Terrell\"> <\/a>Tereal, pemilik Bty Shop, Jobs dan Wozniak diberikan pesanan pembelian pertama mereka, untuk 50 komputer Apple I, hanya jika komputer tersebut dirakit dan diuji dan bukan komputer kit. Terrell ingin memiliki komputer untuk dijual kepada banyak pengguna, bukan hanya penghobi elektronik berpengalaman yang memiliki keterampilan menyolder untuk merakit perangkat komputer. Apple <a href=\"https:\/\/en.wikipedia.org\/wiki\/Apple_I\">I<\/a>yang dikirimkan secara teknis masih merupakan komputer kit, karena tidak memiliki catu daya, casing, atau keyboard saat dikirimkan ke Byte Shop.<\/div><div><br>Komputer pribadi pertama yang berhasil dipasarkan secara massal yang diumumkan adalah <a href=\"https:\/\/en.wikipedia.org\/wiki\/Commodore_PET\">Commodore <\/a>PET setelah diumumkan pada bulan Januari 1977. Namun, komputer tersebut dipesan kembali dan tidak tersedia hingga akhir tahun itu. Tiga bulan kemudian (April), biasanya disebut sebagai \"Apple\" diumumkan dengan unit pertama dikirimkan 10 Juni 1977, dan <a href=\"https:\/\/en.wikipedia.org\/wiki\/TRS-80\">TRS-80<\/a> dari <a href=\"https:\/\/en.wikipedia.org\/wiki\/Tandy_Corporation\">Tandy Corporation<\/a>\/ <a href=\"https:\/\/en.wikipedia.org\/wiki\/Tandy_Radio_Shack\">Tandy Radio Shack<\/a> menyusul pada bulan Agustus 1977, yang terjual lebih dari 100.000 unit selama masa pakainya. Bersama-sama, ketiga mesin ini disebut sebagai \"trinitas 1977\". Komputer siap rakitan yang dipasarkan secara massal telah hadir, dan memungkinkan lebih banyak orang untuk menggunakan komputer, lebih fokus pada aplikasi perangkat lunak dan lebih sedikit pada pengembangan perangkat keras prosesor.<\/div><div><br>Pada tahun 1977 perusahaan Heath memperkenalkan perangkat komputer pribadi yang dikenal sebagai <a href=\"https:\/\/en.wikipedia.org\/wiki\/Heathkit\">Heathkits<\/a>, dimulai dengan <a href=\"https:\/\/en.wikipedia.org\/wiki\/Heathkit_H8\">Heathkit H8<\/a>, diikuti oleh Heathkit H89 pada akhir tahun 1979. Dengan membeli Heathkit H8 Anda akan mendapatkan sasis dan kartu CPU untuk dirakit sendiri, perangkat keras tambahan seperti karena papan memori H8-1 yang berisi RAM 4k juga dapat dibeli untuk menjalankan perangkat lunak. Model Heathkit H11 dirilis pada tahun 1978 dan merupakan salah satu komputer pribadi 16-bit pertama; namun, karena harga ecerannya yang tinggi sebesar $1,295 dihentikan pada tahun 1982.<br><br><br>Pada awal tahun 1980-an, komputer rumahan dikembangkan lebih lanjut untuk keperluan rumah tangga, dengan perangkat lunak untuk produktivitas pribadi, pemrograman, dan permainan. Mereka biasanya dapat digunakan dengan televisi yang sudah ada di rumah sebagai layar komputer, dengan grafik kotak-kotak dengan detail rendah dan rentang warna terbatas, dan teks dengan lebar sekitar 40 karakter dan tinggi 25 karakter. <a href=\"https:\/\/en.wikipedia.org\/wiki\/Sinclair_Research\">Sinclair Research<\/a>, sebuah perusahaan Inggris, memproduksi Seri ZX‍—‌ZX80 (1980), ZX81 (1981), dan ZX Spectrum yang terakhir diperkenalkan pada tahun 1982, dan terjual sebanyak 8 juta unit. Menyusul datangnya Comodore 64, dengan total penjualan 17 juta unit, Galaksija (1983) diperkenalkan di Yugoslavia dan seri Amstrad<a href=\"https:\/\/en.wikipedia.org\/wiki\/Amstrad_CPC\"> CPC (464–6128 <\/a><a href=\"https:\/\/en.wikipedia.org\/wiki\/Galaksija_(computer)\">)<\/a>.<\/div><div><br>Pada tahun yang sama diperkenalkan NEC PC-98 yang merupakan komputer pribadi sangat populer yang terjual lebih dari 18 juta unit. Komputer pribadi terkenal lainya, Amiga1000yang revolusioner , diresmikan oleh Commodore pada tanggal 23 Juli 1985. Amiga 1000 menampilkan sistem operasi multitasking, windowing, grafik berwarna dengan palet 4096 warna, suara stereo, CPU Motorola 68000, 256 KB RAM, dan disk drive 3,5 inci 880 KB, seharga US$1.295. <\/div><div><br>PC pertama IBM diperkenalkan pada 12 Agustus 1981 dengan menetapkan apa yang menjadi standar pasar massal untuk arsitektur PC. <\/div><div><br>Pada tahun 1982 \"The Computer\" dinobatkan sebagai Machine of the Year oleh majalah time<\/div><div><br>Sistem yang lebih besar dan lebih mahal ditujukan untuk penggunaan kantor dan usaha kecil. Ini sering kali menampilkan tampilan teks 80 kolom tetapi mungkin tidak memiliki kemampuan grafis atau suara. Sistem berbasis mikroprosesor ini masih lebih murah dibandingkan mainframe atau komputer mini yang berbagi waktu.<\/div><div><a href=\"https:\/\/en.wikipedia.org\/wiki\/Workstation\"><br><\/a>Workstation dicirikan oleh prosesor dan tampilan grafis berkinerja tinggi, dengan penyimpanan disk lokal berkapasitas besar, kemampuan jaringan, dan berjalan di bawah sistem operasi multitasking. Akhirnya, karena pengaruh IBM PC di pasar komputer pribadi, komputer pribadi dan komputer rumahan kehilangan perbedaan teknisnya. Komputer bisnis memperoleh kemampuan grafis berwarna dan suara, dan pengguna komputer rumahan serta sistem permainan menggunakan prosesor dan sistem operasi yang sama dengan pekerja kantor. Komputer pasar massal memiliki kemampuan grafis dan memori yang sebanding dengan stasiun kerja khusus beberapa tahun sebelumnya. Bahkan jaringan area lokal, yang awalnya merupakan cara untuk memungkinkan komputer bisnis berbagi penyimpanan massal dan periferal yang mahal, menjadi fitur standar komputer pribadi yang digunakan di rumah.<\/div><div><br>Serangkaian penggunaan komputer pribadi yang semakin penting bergantung pada kemampuan komputer untuk berkomunikasi dengan sistem komputer lain, sehingga memungkinkan pertukaran informasi. Akses publik eksperimental ke sistem komputer mainframe bersama telah didemonstrasikan sejak tahun 1973 dalam proyek memori komunitas, namun sistem papan buletin dan penyedia layanan<a href=\"https:\/\/en.wikipedia.org\/wiki\/Online_service_provider\"> <\/a>online menjadi lebih umum tersedia setelah tahun 1978. Penyedia layanan Internet komersial muncul pada akhir tahun 1980an, memberikan akses publik ke sistem komputer mainframe bersama. jaringan yang berkembang pesat.<\/div><div><br>Pada tahun 1991, Word Wide Web tersedia untuk penggunaan umum. Kombinasi komputer pribadi yang kuat dengan grafik dan suara resolusi tinggi, dengan infrastruktur yang disediakan oleh Internet, dan standarisasi metode akses browser Web <a href=\"https:\/\/en.wikipedia.org\/wiki\/Web_browser\">,<\/a>menjadi landasan bagi sebagian besar kehidupan modern, mulai dari tabel waktu bus hingga jadwal tak terbatas. distribusi video gratis melalui ensiklopedia online yang diedit pengguna.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:18:49",
            "updated_at": "2024-05-07 09:52:34"
        },
        {
            "id": "12",
            "category_id": "4",
            "user_id": "5",
            "title": "Bermain Infrared Arduino",
            "slug": "bermain-infrared-arduino",
            "image": "post-images\/l2CZgCiLEGfkTg4MQA8y0oxQTbFBqtIgdLqb2GoF.png",
            "excerpt": "DESKRIPSI Bermain Arduino Infrared Sensor, dengan VCC sebesar 5 Volt dan Output dimasukkan pada arduino pin digital nomor 8. Infrared akan memberikan output kepada pin digital 8 yang dapat digunakan s...",
            "body": "<div><strong>DESKRIPSI <br><\/strong>Bermain Arduino Infrared Sensor, dengan VCC sebesar 5 Volt dan Output dimasukkan pada arduino pin digital nomor 8. Infrared akan memberikan output kepada pin digital 8 yang dapat digunakan sebagai indikator dalam arduino tersebut, ataupun dapat digunakan sebagai variabel pada arduino untuk nantinya digunakan sebagai penggerak robotik maupun dalam embedded system, adapun kemungkinan penggunaan output tersebut sangat bervariasi.<br>Tata cara melakukannya dapat dilakukan dengan menyambungkan Micro USB pada laptop atau PC, lalu dapat menyambungkan jumper sesuai gambar tersebut. selanjutnya output dapat digunakan sesuai dengan keinginan sendiri.<br><br><strong>ALAT DAN BAHAN YANG DIPERLUKAN<br><\/strong>1. Kabel Micro USB<br>2. Kabel Jumper secukupnya<br>3. Sensor Infrared<br>4. Laptop<br><br><br> <\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:24:36",
            "updated_at": "2024-05-07 08:47:54"
        },
        {
            "id": "14",
            "category_id": "8",
            "user_id": "3",
            "title": "Bahasa C",
            "slug": "bahasa-c",
            "image": "post-images\/2Qtm5JmyX74hm1YuT2nBRQ2lZq0cIp31ADZTdz9s.jpg",
            "excerpt": "Bahasa pemrograman C adalah bahasa pemrograman komputer bertujuan umum yang dibuat pada tahun 1972 oleh Dennis Ritchie untuk Sistem Operasi Unix di Bell Telephone Laboratories. Dengan desain, fitur C...",
            "body": "<div><strong><em>Bahasa pemrograman C<\/em><\/strong> adalah bahasa pemrograman komputer bertujuan umum yang dibuat pada tahun 1972 oleh Dennis Ritchie untuk Sistem Operasi Unix di Bell Telephone Laboratories. Dengan desain, fitur C dengan jelas mencerminkan kemampuan CPU yang ditargetkan.<br><br>Meskipun C dibuat untuk memprogram sistem dan jaringan komputer namun bahasa ini juga sering digunakan dalam mengembangkan software aplikasi. C juga banyak dipakai oleh berbagai jenis platform sistem operasi dan arsitektur komputer, bahkan terdapat beberepa compiler yang sangat populer telah tersedia. C secara luar biasa memengaruhi bahasa populer lainnya, terutama C++ yang merupakan extensi dari C.<br><br>Sejak 2000, C secara konsisten menempati peringkat di antara dua bahasa teratas diTIOBE index, sebuah pengukuran dari popularitas bahasa pemrograman.<br><br><strong><em>Sejarah <br><\/em><\/strong><em>Perkembangan awal<\/em><br>Asal usul C terkait erat dengan pengembangan sistem operasi Unix, yang awalnya diimplementasikan dalam bahasa assembly pada PDP-7 oleh Dennis Ritchie dan Ken Thompson, menggabungkan beberapa ide dari rekan-rekannya. Akhirnya, mereka memutuskan untuk mem-porting sistem operasi ke PDP-11. Versi asli Unix PDP-11 juga dikembangkan dalam bahasa assembly.<br><br>Thompson menginginkan bahasa pemrograman untuk mengembangkan utilitas untuk platform baru. Pada awalnya, dia mencoba menulis kompiler Fortran, tetapi segera menyerah. Sebaliknya, ia menciptakan versi sederhana dari bahasa pemrograman sistem yang baru dikembangkan yang disebut BCPL. Deskripsi resmi BCPL belum tersedia pada saat itu dan Thompson memodifikasi sintaksisnya agar tidak terlalu bertele-tele, dan mirip dengan ALGOL sederhana yang dikenal sebagai SMALGOL. Thompson menyebut hasilnya B. Dia menggambarkan B sebagai \"semantik BCPL dengan banyak sintaksis SMALGOL\". Seperti BCPL, B memiliki kompiler bootstrapping untuk memfasilitasi porting ke mesin baru. Namun, hanya sedikit utilitas yang akhirnya ditulis dalam B karena terlalu lambat, dan tidak dapat memanfaatkan fitur PDP-11 seperti kemampuan pengalamatan byte.<br><br><strong><em>Pertama Liris<br><\/em><\/strong>Pada tahun 1971, Ritchie mulai menyempurnakan B, untuk memanfaatkan fitur PDP-11 yang lebih bertenaga. Tambahan yang signifikan adalah tipe data karakter. Dia menyebutnya B Baru (NB). Thompson mulai menggunakan NB untuk menulis kernel Unix, dan persyaratannya membentuk arah pengembangan bahasa. Hingga tahun 1972, tipe yang lebih kaya ditambahkan ke bahasa NB: NB memiliki array int dan char. Pointer, kemampuan untuk menghasilkan pointer ke tipe lain, semua tipe array, dan tipe yang akan dikembalikan dari fungsi semuanya juga ditambahkan. Array dalam ekspresi menjadi pointer. Kompiler baru telah ditulis, dan bahasanya diganti namanya menjadi C.<br><br>Kompiler C dan beberapa utilitas yang dibuat dengannya disertakan dalam Unix Versi 2, yang juga dikenal sebagai Research Unix.<br><br><strong><br><\/strong><strong><em>Struktur dan penulisan ulang kernel Unix<\/em><\/strong><strong><br><\/strong>Pada Versi 4 Unix, dirilis pada bulan November 1973, kernel Unix diimplementasikan kembali secara ekstensif di C. Pada saat ini, bahasa C telah memperoleh beberapa fitur canggih seperti tipe struct.<br><br>Praprosesor diperkenalkan sekitar tahun 1973 atas desakan Alan Snyder dan juga sebagai pengakuan atas kegunaan mekanisme penyertaan file yang tersedia di BCPL dan PL\/I. Versi aslinya hanya menyediakan file yang disertakan dan penggantian string sederhana: #include dan #define makro tanpa parameter. Segera setelah itu, diperluas, sebagian besar oleh Mike Lesk dan kemudian oleh John Reiser, untuk menggabungkan makro dengan argumen dan kompilasi bersyarat.<br><br>Unix adalah salah satu kernel sistem operasi pertama yang diimplementasikan dalam bahasa selain bahasa assembly. Contoh sebelumnya termasuk sistem Multics (yang ditulis dalam PL\/I) dan Master Control Program (MCP) untuk Burroughs B5000 (yang ditulis dalam ALGOL) pada tahun 1961. Sekitar tahun 1977, Ritchie dan Stephen C. Johnson membuat perubahan lebih lanjut pada bahasa untuk memfasilitasi portabilitas sistem operasi Unix. Kompiler C Portabel Johnson menjadi dasar untuk beberapa implementasi C pada platform baru.<br><br><strong><em>Contoh <br><\/em><\/strong> #include &lt;stdio.h&gt;<br> int main(void) <br> {<br> printf(\"Hello, World!\\n\");<br> return 0;<br> }<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:29:29",
            "updated_at": "2024-05-07 08:31:17"
        },
        {
            "id": "15",
            "category_id": "5",
            "user_id": "4",
            "title": "Arknights",
            "slug": "arknights",
            "image": "post-images\/lqK3M1HCSY1ei9CQJTUnoCj2LqezXFmmHnmToO9y.jpg",
            "excerpt": "Arknights adalah permainan seluler gratis yang dikembangkan oleh Hypergryph, yang juga menerbitkan server Chinese\/CN game (yang menggunakan Simplified Chinese) bersama Bilibili. Di luar China, Arknigh...",
            "body": "<div>Arknights adalah permainan seluler gratis yang dikembangkan oleh Hypergryph, yang juga menerbitkan server Chinese\/CN game (yang menggunakan Simplified Chinese) bersama Bilibili. Di luar China, Arknights diterbitkan oleh Yostar untuk bahasa Jepang\/JP, Korea\/KR, dan Inggris\/EN[catatan 1] server (secara kolektif disebut sebagai server Global[catatan 2]), dan Longcheng, anak perusahaan dari perusahaan Cina XD Inc., untuk server Taiwan\/TW (yang menggunakan bahasa Cina Tradisional) yang juga mencakup Hong Kong dan Makau.<br>Arknights adalah unik di mana ia mencampur unsur-unsur dari keduanya taktis RPG and pertahanan menara game, yang berkontribusi terhadap meningkatnya popularitasnya baik di daratan Tiongkok maupun di seluruh dunia setelah game tersebut dirilis secara internasional.&nbsp;<br><br><\/div><h1>Sinopsis<\/h1><div><em>Arknights<\/em> berlangsung di dunia distopia Terra. Terra mungkin tampak awalnya mirip dengan Bumi kita, dunia modern dengan tingkat teknologi yang relatif sama – mungkin sedikit lebih futuristik. Namun, penduduknya, the \"Ancients\", sifat kebinatangan olahraga. Dunia terus-menerus dihancurkan oleh Bencana, bencana ekologis dari berbagai macam, memaksa penduduk dunia untuk mengadopsi kehidupan nomaden melalui kota-kota nomaden. Seiring dengan Bencana datang Originium, mineral kristal hitam yang tertinggal setelah Bencana. Originium banyak digunakan oleh Terrans sebagai sumber energi dan bahan teknik, dan berfungsi sebagai katalis kekuatan mirip sihir yang dikenal sebagai Seni Originium. Namun, paparan Originium menyebabkan \"penyakit terminal\" yang dikenal sebagai Oripati, yang telah menjadi pandemi yang melanda seluruh Terra. Oripati tidak mudah menular, setidaknya sampai kematian dan kristalisasi korbannya. Namun demikian, mereka yang terserang Oripathy dikenal sebagai Terinfeksi dan menderita penindasan berat dan marginalisasi di seluruh dunia.<br><br><\/div><div><br>Permainan ini diceritakan dari sudut pandang Pulau Rhodes, sebuah perusahaan farmasi internasional non-pemerintah yang berbasis di tanah nomaden eponymous, yang misinya adalah untuk membantu yang Terinfeksi. Rhodes Island mempekerjakan banyak orang yang Terinfeksi dan tidak Terinfeksi <a href=\"https:\/\/arknights.fandom.com\/wiki\/Operator\">Operator<\/a> dari berbagai keterampilan, perdagangan, dan asal; dan secara efektif terbukti jauh lebih dari laboratorium sederhana, membanggakan taktik paramiliter dan daya tembak dari sebuah perusahaan militer swasta kecil. Karena mereka paling baik digunakan untuk menangani Orang yang Terinfeksi, RI terlibat konflik <a href=\"https:\/\/arknights.fandom.com\/wiki\/Reunion\">Reunion<\/a>, aktor non-negara yang kejam yang terdiri dari radikal <a href=\"https:\/\/arknights.fandom.com\/wiki\/Infected\">Terinfeksi<\/a> militan yang berniat menghukum Terrans atas penderitaan mereka. Meskipun Reunion adalah antagonis awal game ini, Reunion telah meluas ke konflik lain, termasuk konflik suksesi <a href=\"https:\/\/arknights.fandom.com\/wiki\/Victoria\">Victoria<\/a>, kapitalisme yang merajalela dari <a href=\"https:\/\/arknights.fandom.com\/wiki\/Kazimierz\">Kazimierz<\/a>, melanggar ancaman dunia lain seperti \"<a href=\"https:\/\/arknights.fandom.com\/wiki\/Feranmut\">dewa<\/a>\" dari <a href=\"https:\/\/arknights.fandom.com\/wiki\/Yan\">Yan<\/a> and the <a href=\"https:\/\/arknights.fandom.com\/wiki\/Seaborn\">Seaborn<\/a> dari <a href=\"https:\/\/arknights.fandom.com\/wiki\/Aegir\">Aegir<\/a>, dan perang saudara yang tidak pernah berakhir di <a href=\"https:\/\/arknights.fandom.com\/wiki\/Kazdel\">Kazdel<\/a>, antara lain. Protagonis dari <em>Arknights<\/em> adalah individu yang penuh teka-teki yang hanya dikenal sebagai <a href=\"https:\/\/arknights.fandom.com\/wiki\/Doctor\">the Doctor<\/a>. Dokter telah kehilangan ingatan mereka karena stasis yang lama di Sarkofagus misterius di bawah <a href=\"https:\/\/arknights.fandom.com\/wiki\/Nomadic_city\">kota nomaden<\/a> dari <a href=\"https:\/\/arknights.fandom.com\/wiki\/Chernobog\">Chernobog<\/a>, <a href=\"https:\/\/arknights.fandom.com\/wiki\/Ursus_(country)\">Ursus<\/a>. Mereka diselamatkan dalam aksi pembuka permainan oleh Rhodes Island, membutuhkan kejeniusan taktis mereka untuk bertindak sebagai komandan mereka.<br><br><\/div><div><br>Secara keseluruhan, <em>Arknights<\/em> banyak membahas tema-tema marginalisasi, penindasan, rasisme, xenofobia, dan geopolitik<br><br><\/div><h1>Gameplay<\/h1><div><br>Mereka yang telah memainkan game tower defense (TD) akan terbiasa dengan Arknights' gameplay: pemain harus menjaga musuh dari mencapai tujuan tertentu dengan menggunakan \"menara.\"<br><br>Namun, Arknights mengintegrasikan perbedaan desain yang signifikan: unik Operator bertindak sebagai menara yang dapat ditempatkan di sekitar peta dan menahan musuh baik dengan menyerang atau memblokir mereka, dan karena mekanisme perkembangannya yang terinspirasi RPG dan keahlian Operator yang unik, tidak ada dua \"menara\" yang biasanya bekerja sama. Dibandingkan dengan kebanyakan game TD lainnya, Arknights fitur mekanik yang agak unik, karena dirancang untuk menjadi permainan menara pertahanan yang bermain seperti RPG strategi. Musuh mengambil berbagai jalur yang tidak biasa untuk mencapai tujuan mereka, ada berbagai macam jenis musuh dengan karakteristik dan perilaku unik mereka sendiri, beberapa peristiwa tahap benar-benar menjungkirbalikkan dinamika menara pertahanan, dan gameplay cenderung secara signifikan lebih menantang daripada rata-rata.<br><br>Arknights secara alami mengintegrasikan sistem perkembangan karakter seperti kebanyakan gacha, yang menyiratkan beberapa tahapan pertanian berulang untuk memperoleh sumber daya yang diperlukan untuk meningkatkan Operator mereka. Untuk itu, Arknights termasuk Menyebarkan Otomatis fitur yang, secara unik, menyimpan rekaman semi-eksak dari setiap masukan, urutan penerapan, dan aktivasi keterampilan pemain dari penjelasan sempurna sebelumnya di peta itu, memungkinkan peta tersebut diselesaikan sendiri tanpa masukan pemain lebih lanjut dan membuat \"penggilingan\" untuk sumber daya yang tidak terlalu membosankan.<br><br>Arknights termasuk Kompleks Infrastruktur Pulau Rhodes, Basis di mana Operator dapat ditugaskan untuk bekerja dan menghasilkan bahan tambahan untuk meningkatkan kemampuan mereka, mekanik bangunan dasar yang mengharuskan pemain untuk melakukan sejumlah manajemen dan pemikiran.<br><br>Meskipun hanya menjadi PvE permainan, Arknights apakah menampilkan mekanisme kooperatif antar pemain dalam bentuk Unit Dukungan and the Kredit system. Sebuah mode permainan koperasi yang sebenarnya, Kerjasama Multivariat, juga ditampilkan sebagai acara dengan waktu terbatas.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:38:20",
            "updated_at": "2024-05-07 10:08:01"
        },
        {
            "id": "16",
            "category_id": "5",
            "user_id": "3",
            "title": "Valorant",
            "slug": "valorant",
            "image": "post-images\/kWRB0wV9MmHBh4F1m1fAirCodfEpXu0U4Euq2P2N.jpg",
            "excerpt": " Valorant adalah permainan video POP (penembak orang pertama) taktis multipemain gratis yang dikembangkan dan diterbitkan oleh Riot Games, untuk Microsoft Windows. Pertama kali menggoda dengan nama ko...",
            "body": "<div> <strong><em>Valorant<\/em><\/strong> adalah permainan video POP (penembak orang pertama) taktis multipemain gratis yang dikembangkan dan diterbitkan oleh Riot Games, untuk Microsoft Windows. Pertama kali menggoda dengan nama kode Project A pada Oktober 2019, permainan memulai periode beta tertutup dengan akses terbatas pada 7 April 2020, diikuti dengan perilisan resmi pada 2 Juni 2020. Pengembangan permainan dimulai pada 2014.<br><br><strong><em>Alur Permainan<br><\/em><\/strong>Valorant adalah penembak taktis berbasis tim dan penembak orang pertama yang diatur dalam dekat masa depan. Pemain bermain sebagai salah satu dari sekumpulan agen, karakter yang dirancang berdasarkan beberapa negara dan budaya di seluruh dunia. Dalam mode permainan utama, pemain ditugaskan ke tim menyerang atau bertahan dengan masing-masing tim memiliki lima pemain di dalamnya. Agen memiliki kemampuan unik, masing-masing membutuhkan biaya, serta kemampuan akhir unik yang membutuhkan pengisian melalui pembunuhan, kematian, atau aksi spike. Setiap pemain memulai setiap putaran dengan pistol \"classic\" dan satu atau lebih muatan \"kemampuan khas\". Senjata dan biaya kemampuan lainnya dapat dibeli menggunakan sistem ekonomi dalam permainan yang memberikan uang berdasarkan hasil putaran sebelumnya, pembunuhan apa pun yang menjadi tanggung jawab pemain, dan tindakan apa pun yang diambil dengan spike. Agen yang berbeda memungkinkan pemain menemukan lebih banyak cara untuk memasang Spike dan gaya pada musuh dengan scrappers, ahli strategi, dan pemburu dari setiap deskripsi. Saat ini, menawarkan 21 agen untuk dipilih. Mereka adalah Brimstone, Phoenix, Sage, Harbor, Sova, Gekko, Viper, Cypher, Reyna, Killjoy, Fade, Neon, Breach, Omen, Jett, Raze, Skye, Yoru, Astra, KAY\/O, dan Chamber.<br><br><strong><em>Perilisan<br><\/em><\/strong>Valorant diungkap dengan judul tentatif Project A pada Oktober 2019. Itu diumumkan pada 1 Maret 2020, dengan video alur permainan di YouTube disebut \"The Round\". Beta tertutup dari permainan ini diluncurkan pada 7 April 2020. Untuk kesempatan mendapatkan kunci akses beta, pemain diminta untuk mendaftar akun dengan Riot Games dan platform streaming Twitch dan menonton streaming terkait. Beta ini berakhir pada 28 Mei 2020, dengan permainan ini dirilis sepenuhnya pada 2 Juni 2020.<br><br><strong><em>Esport<br><\/em><\/strong>Valorant, seperti banyak kompetitif penembak lainnya, telah menjadi aktif dalam esports. Riot Games memutuskan untuk membuat turnamen pertama yang disebut “First Strike” untuk membangun fondasi untuk adegan esports yang akan dibuat dengan permainan tersebut. Pada bulan November 2020, Riot Games mengumumkan seri turnamen yang disebut VALORANT Champions Tour (VCT) yang merupakan kompetisi sepanjang tahun yang terdiri dari 3 level:<br><br>- VALORANT Challengers - kompetisi regional yang merupakan kualifikasi untuk Masters.<br>- VALORANT Masters - kompetisi internasional di pertengahan musim, dibagi menjadi 3 tahap.<br>- VALORANT Champions* - kejuaraan dunia untuk tahun tersebut.<br>*Tim akan langsung lolos ke Champions melalui posisi teratas di Circuit Point Standings di wilayah mereka, berdasarkan hasil Challengers dan Master. Tim yang berada di posisi tengah dalam Circuit Point Standings akan memiliki satu kesempatan lagi untuk lolos ke Champions dengan memenangkan Last Chance Qualifiers (Amerika Utara, EMEA, Amerika Selatan, Asia). VALORANT Conquerors Championship (VCC) - Tim Asia Selatan langsung lolos ke Last Chance Qualifiers of Asia melalui VCC.<br><br>VALORANT Champions 2021 adalah kompetisi yang bertujuan untuk mendeklarasikan juara global pertama esports Valorant, yang akan diselenggarakan pada bulan Desember.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:50:16",
            "updated_at": "2024-05-07 08:50:16"
        },
        {
            "id": "17",
            "category_id": "8",
            "user_id": "3",
            "title": "Hypertext Markup Language",
            "slug": "hypertext-markup-language",
            "image": "post-images\/dAkd6vyQhwrfjtoKspvjTipRkj2J1lBtI0emxM9Z.jpg",
            "excerpt": "HTML adalah bahasa yang digunakan untuk membuat halaman web. Bagi yang berkecimpung di dunia perangkat gadget dan ilmu komputer, pasti sudah tidak asing lagi dengan berbagai kode di dalamnya. HTML ada...",
            "body": "<div><strong><em>HTML<\/em><\/strong> adalah bahasa yang digunakan untuk membuat halaman web. Bagi yang berkecimpung di dunia perangkat gadget dan ilmu komputer, pasti sudah tidak asing lagi dengan berbagai kode di dalamnya. HTML adalah kependekan dari Hypertext Markup Language.<br><br>Berbeda dengan orang awam, mungkin hanya sekedar mendengar istilah HTML semata. Tanpa tahu makna pengertian HTML dan kegunaan sebenarnya. Terutama maksud di balik kode-kode yang tersusun.<br><br>Kode HTML tersebut memastikan format teks dan gambar yang tepat untuk browser Internet. Tanpa HTML, browser tidak akan tahu bagaimana menampilkan teks sebagai elemen atau memuat gambar atau elemen lainnya.<br><br><strong><em>Pengertian<br><\/em><\/strong>HTML adalah bahasa standar pemrogaman yang digunakan untuk membuat halaman website, yang diakses melalui internet. Singkatan dari \"Hypertext Markup Language\" atau \"bahasa markup\". Dilansir <a href=\"https:\/\/techterms.com\/definition\/html\"><strong>Techterms<\/strong><\/a>, \"Hypertext\" mengacu pada hyperlink yang mungkin terdapat dalam halaman HTML. Bahasa markup ini mengacu pada cara tag yang digunakan, untuk menentukan tata letak halaman dan elemen di dalam halaman. HTML disusun berdasar kode dan simbol tertentu, yang dimasukkan dalam sebuah file atau dokumen. Sehingga bisa ditampilkan pada layar komputer. Dan bisa dipahami oleh para pengguna internet.<br><br><\/div><div>Memahami setiap kata yang terkandung, hypertext sendiri dimaksudkan sebagai metode yang digunakan untuk berpindah laman web ke laman lain. Usai mengklik tulisan atau simbol yang muncul di halaman website.<br><br><\/div><div>Lalu istilah markup, diartikan sebagai suatu hal yang dilakukan tag HTML terhadap teks didalamnya. Contoh jika mengetik suatu teks dengan tanda tag . Maka teks tersebut akan muncul dengan huruf tebal atau bold di laman website.<br>Melansir dari <a href=\"https:\/\/www.nesabamedia.com\/pengertian-dan-fungsi-html\/\"><strong>Nesabamedia<\/strong><\/a>, 'language' berarti bahasa pemrograman atau script. Disusun dari tag-tag tertentu yang akan diterjemahkan dalam teks atau visual yang bisa dilihat di website.<\/div><div><br><strong><em>Fungsi HTML<br><\/em><\/strong>Dikutip dari <a href=\"https:\/\/www.computerhope.com\/jargon\/h\/html.htm\"><strong>Computerhope<\/strong><\/a>, HTML digunakan untuk membuat dokumen elektronik (disebut halaman) yang ditampilkan di World Wide Web (www). Setiap halaman berisi serangkaian koneksi ke halaman lain yang disebut hyperlink. Setiap halaman web yang Anda lihat di Internet ditulis menggunakan satu versi kode HTML atau yang lain. Kode HTML memastikan format teks dan gambar yang tepat untuk browser Internet. Tanpa HTML, browser tidak akan tahu bagaimana menampilkan teks sebagai elemen atau memuat gambar atau elemen lainnya. HTML juga menyediakan struktur dasar halaman, di mana Cascading Style Sheets dihamparkan untuk mengubah tampilannya.<br><br>HTML dianggap sebagai tulang (struktur) dari sebuah halaman web, dan CSS sebagai kulitnya atau tampilan. Berikut fungsi HTML:<br><br><\/div><div>1. Fungsi utama HTML, untuk membuat suatu halaman website yang bisa dibaca dan dipahami dengan lebih mudah. Seluruh laman website yang ada di internet, dibuat dengan HTML dan tak ada pengecualian.<br><br><\/div><div>2. Menandai teks pada suatu laman. HTML ditulis pada suatu halaman dokumen dengan tag atau simbol tertentu. Simbol dan tag tersebut akan membuat tampilan teks menjadi tebal, miring, bergaris tebal dan sebagainya. Semisal jika membuat suatu teks menjadi teks miring atau italic, di laman HTML harus ditulis kode , untuk teks tebal dan - - untuk teks bergaris bawah.<br><br>3. Sebagai dasar website. Website yang dibuat tentu memiliki beberapa fitur. Dibuat menggunakan java script untuk mengatur perilaku web, implemetasi bahasa pemrograman server PHP, dan mendesain web menggunakan CSS. Semua bahasa ini dapat diaplikasikan jika web memiliki bahasa HTML sebagai dasarnya.<br><br><\/div><div>4. Menampilkan tabel, gambar, video dan lainnya. Umumnya di halaman website atau blog kita tidak bisa langsung meletakkan tabel, gambar maupun video. Sehingga butuh komponen yang diletakkan pada web menggunakan bahasa HTML.<br><br>5. Menandai elemen dan membuat online form. HTML berfungsi menandai bagian-bagian dalam website di antaranya header, footer, main, navigation dan sebagainya. Selain itu HTML juga digunakan sebagai bahasa dalam membuat formulir digital atau online form.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:57:24",
            "updated_at": "2024-05-07 08:57:24"
        },
        {
            "id": "18",
            "category_id": "3",
            "user_id": "2",
            "title": "Love Live",
            "slug": "love-live",
            "image": "post-images\/RIGavjR8pU7Mystn3jyysDZL5M1Agg2tZ252Oexk.jpg",
            "excerpt": "Love Live! School Idol Project Series is a Japanese multimedia project created by Hajime Yatate and Sakurako Kimino and co-produced by Kadokawa through ASCII Media Works; Bandai Namco Music Live throu...",
            "body": "<div><strong>Love Live! School Idol Project Series<\/strong> is a Japanese multimedia project created by Hajime Yatate and Sakurako Kimino and co-produced by Kadokawa through ASCII Media Works; Bandai Namco Music Live through music label Lantis; and animation studio Sunrise. Each of the individual titles within the franchise revolve around teenage girls who become \"school idols\". Starting in June 2010 with<em> Love Live! School Idol Project<\/em>, the franchise has seen multiple anime television series, two anime films, light novels, manga, and video games. The rhythm game series <em>Love Live! School Idol Festival<\/em> features characters across multiple Love Live! titles.<br><br><strong><br>Overview<\/strong><br>Each title in the Love Live! franchise focuses on groups of teenage schoolgirls who become \"school idols\" as an extracurricular activity,and their main activities involve singing and choreographed dancing to self-written songs they perform at concerts or other music events. Other activities include designing their own costumes, as well as filming promotional videos and music videos. Top-class groups are very popular among fans of school idols, aided in part by exposure in magazines and other media, in addition to merchandise of school idols sold in shops catering to otaku-related items.<br><br>The ultimate school idol competition featuring the best groups in Japan is called Love Live, and entry into the competition is determined by the popularity of each group. The size of these groups can range anywhere from solo idols to groups with nine or more members. Due to the highly competitive nature of the Love Live competition, some school idols opt not to attempt entry and simply take part in performing at other events. However, participation in the event is very prestigious, and any group that wins the competition is afforded legendary status.<br><br><br><strong>Franchise history<\/strong><br>Love Live! School Idol Project was first announced in the July 2010 issue of ASCII Media Works' Dengeki G's Magazine, which revealed that the magazine would be collaborating with the anime studio Sunrise and the music label Lantis to co-produce the project. The project officially began with the August 2010 issue of Dengeki G's Magazine, which introduced the story, characters, and a more detailed explanation of the project.The original plan for the story was written by Sakurako Kimino, who also writes short stories and light novels for Love Live!. Yūhei Murota created the original character designs.<br><br>Starting in August 2010, online mobile phone popularity contests were periodically held to rank the characters, which influenced the positions of the idols in the anime music videos produced by Sunrise. For example, the idol who ranked first in a given contest would be in the center position in the front row in the music video that followed. Other polls were used to determine different aspects of the idols, such as hairstyles and costumes. Fans also determined the name of the initial school idol group, ultimately choosing the name μ's (\/mjuz\/, muse). Lantis released the group's first single in August 2010,[4] and they continued to release several more singles and albums over the course of the next two years, including performing their first concert in 2012 at Yokohama Blitz in Yokohama, Japan. This was soon followed by an anime television series that aired from 2013 to 2014, and an anime film in 2015.<br><br>The rhythm game series Love Live! School Idol Festival developed by KLab and published by Bushiroad's Bushimo for Android and iOS platforms launched in 2013. The initial game is free-to-play with an in-app purchase system. It features songs and characters across multiple Love Live! titles, along with newly introduced girls, and stories that are not included in other media. The English localization was released worldwide in 2014, and it also was localized in China, Hong Kong, Macau, Taiwan, and South Korea. An arcade version of the game developed and published by Square Enix titled Love Live! School Idol Festival: After School Activity was released in Japan in 2016, and a PlayStation 4 port was released in North America, Japan, and Southeast Asia in 2021. Another spin-off game titled Love Live! School Idol Festival All Stars was released in 2019 in Japan and 2020 worldwide.<br><br>The next major installment in the franchise was the spin-off Love Live! Sunshine!! announced in 2015. Fans also chose the name of the idol group for Sunshine, deciding on the name Aqours (\/ˈækwə\/, aqua). Similarly to Love Live! School Idol Project, Lantis released the group's first single in October 2015, releasing several more singles into the following year. This was followed by an anime television series that aired from 2016 to 2017, and an anime film in 2019.<br><br>In March 2017, the official website of Love Live School Idol Festival launched the \"Perfect Dream Project\", which featured nine new girls that would be incorporated into Love Live! Nijigasaki High School Idol Club; a tenth member was added in 2020. Unlike μ's and Aqours, they are not a traditional group, but rather individual school idols who compete with each other are referred to collectively as the Nijigasaki High School Idol Club. The idols are featured in Love Live! School Idol Festival All Stars alongside μ's and Aqours, and also appear in the main Love Live! School Idol Festival game. Lantis released the debut album for Nijigasaki High School Idol Club in 2018, and this was followed by two more albums and several singles over the course of the next two years, including performing their first concert in 2018 at DiverCity Tokyo Plaza Festival Square. An anime television series premiered in 2020, with a second season which premiered in 2022.<br><br>In January 2020, a franchise-wide concert, titled Love Live! Fest, were held at Saitama Super Arena, in commemoration for the franchise's ninth anniversary. All three groups at the time performed at this concert, including μ's, which was their first performance after a three-year hiatus since their \"final\" concert in April 2016.<br><br>Another spin-off titled Love Live! Superstar!! was announced in 2020 as an anime television series. Fans also chose the name of the idol group for Superstar, deciding on Liella! (\/liːɛlɑː\/). The anime series premiered in 2021; a second season aired in 2022. A third season is scheduled for 2024.<br><br>Another spin-off, focusing on \"virtual school idols\" was announced in February 2022. They began their activities in late 2022, with the six new girls referred to as the Hasunosora Girls' High School Idol Club. A teaser video in October 2022 announced the launch of a smartphone app, Link! Like! Love Live!, released in April 2023.<br><br><br><strong>School idol groups<br><\/strong><a href=\"https:\/\/en.wikipedia.org\/wiki\/Love_Live!_School_Idol_Project#%CE%BC's\"><strong>μ's<\/strong><\/a> <br>Honoka Kōsaka (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Emi_Nitta\">Emi Nitta<\/a>) <br>Eli Ayase (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Yoshino_Nanj%C5%8D\">Yoshino Nanjō<\/a>) <br>Kotori Minami (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Aya_Uchida\">Aya Uchida<\/a>) <br>Umi Sonoda (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Suzuko_Mimori\">Suzuko Mimori<\/a>) <br>Rin Hoshizora (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Riho_Iida\">Riho Iida<\/a>)<br>Maki Nishikino (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Pile_(singer)\">Pile<\/a>)<br>Nozomi Tojo (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Aina_Kusuda\">Aina Kusuda<\/a>)<br>Hanayo Koizumi (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Yurika_Kubo\">Yurika Kubo<\/a>) <br>Nico Yazawa (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Sora_Tokui\">Sora Tokui<\/a>)<br><br><a href=\"https:\/\/en.wikipedia.org\/wiki\/Love_Live!_Sunshine#Aqours\"><strong>Aqours<\/strong><\/a> <br>Chika Takami (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Anju_Inami\">Anju Inami<\/a>)<br>Riko Sakurauchi (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Rikako_Aida\">Rikako Aida<\/a>)<br>Kanan Matsuura (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Nanaka_Suwa\">Nanaka Suwa<\/a>)<br>Dia Kurosawa (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Arisa_Komiya\">Arisa Komiya<\/a>)<br>You Watanabe (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Shuka_Sait%C5%8D\">Shuka Saitō<\/a>)<br>Yoshiko Tsushima (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Aika_Kobayashi\">Aika Kobayashi<\/a>) <br>Hanamaru Kunikida (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Kanako_Takatsuki\">Kanako Takatsuki<\/a>) <br>Mari Ohara (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Aina_Suzuki\">Aina Suzuki<\/a>)<br>Ruby Kurosawa (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Ai_Furihata\">Ai Furihata<\/a>)<br><br><a href=\"https:\/\/en.wikipedia.org\/wiki\/Love_Live!_Nijigasaki_High_School_Idol_Club#Nijigasaki_High_School_Idol_Club\"><strong>Nijigasaki High School Idol Club<\/strong><\/a> <br> Ayumu Uehara (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Aguri_%C5%8Cnishi\">Aguri Ōnishi<\/a>)<br>Kasumi Nakasu (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Mayu_Sagara\">Mayu Sagara<\/a>) <br>Shizuku Osaka (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Kaori_Maeda\">Kaori Maeda<\/a>)<br>Karin Asaka (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Miyu_Kubota\">Miyu Kubota<\/a>) <br>Ai Miyashita (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Natsumi_Murakami_(voice_actress)\">Natsumi Murakami<\/a>)<br>Kanata Konoe (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Akari_Kit%C5%8D\">Akari Kitō<\/a>)<br>Yuu Takasaki (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Hinaki_Yano\">Hinaki Yano<\/a>)<br>Setsuna Yuki (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Tomori_Kusunoki\">Tomori Kusunoki<\/a>) (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Coco_Hayashi\">Coco Hayashi<\/a>)<br>Emma Verde (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Maria_Sashide\">Maria Sashide<\/a>)<br>Rina Tennoji(<a href=\"https:\/\/en.wikipedia.org\/wiki\/Chiemi_Tanaka\">Chiemi Tanaka<\/a>)<br>Shioriko Mifune (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Moeka_Koizumi\">Moeka Koizumi<\/a>) <br>Mia Taylor (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Shu_Uchida\">Shu Uchida<\/a>) <br>Lanzhu Zhong (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Akina_Houmoto\">Akina Houmoto<\/a>)<br><br><a href=\"https:\/\/en.wikipedia.org\/wiki\/Love_Live!_Superstar#Liella!\"><strong>Liella!<\/strong><\/a> <br>Kanon Shibuya (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Sayuri_Date\">Sayuri Date<\/a>)<br>Keke Tang (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Liyuu\">Liyuu<\/a>) <br>Chisato Arashi (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Nako_Misaki\">Nako Misaki<\/a>)<br>Sumire Heanna (Naomi Payton)  <br>Ren Hazuki (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Nagisa_Aoyama\">Nagisa Aoyama<\/a>) <br>Kinako Sakurakoji (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Nozomi_Suzuhara\">Nozomi Suzuhara<\/a>)<br>Mei Yoneme (Akane Yabushima) <br>Shiki Wakana (Wakana Ōkuma) <br>Natsumi Onitsuka (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Aya_Emori\">Aya Emori<\/a>) <br>Wien Margarete (<a href=\"https:\/\/en.wikipedia.org\/wiki\/Yuina_(musician)\">Yuina<\/a>) <br>Tomari Onitsuka (Sakura Sakakura)<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 08:58:57",
            "updated_at": "2024-05-07 09:02:28"
        },
        {
            "id": "19",
            "category_id": "4",
            "user_id": "3",
            "title": "Air Conditioner (AC)",
            "slug": "air-conditioner-ac",
            "image": "post-images\/T4q6Oh4VXprTbeHxo5V9w5i9O5tdFcqNQKfFSW69.jpg",
            "excerpt": " Air Conditioner (AC), sering disingkat A\/C (US) atau air con (UK), adalah proses menghilangkan panas dari ruang tertutup untuk mencapai lingkungan interior yang lebih nyaman (terkadang disebut sebaga...",
            "body": "<div> <strong><em>Air Conditioner (AC),<\/em><\/strong> sering disingkat A\/C (US) atau air con (UK), adalah proses menghilangkan panas dari ruang tertutup untuk mencapai lingkungan interior yang lebih nyaman (terkadang disebut sebagai 'pendinginan yang nyaman') dan dalam beberapa kasus juga mengontrol secara ketat kelembapan udara internal. Pengkondisian udara dapat dicapai dengan menggunakan 'penyejuk udara' mekanis atau dengan metode lain, termasuk pendinginan pasif dan pendinginan ventilasi . Pendingin udara adalah anggota keluarga sistem dan teknik yang menyediakan pemanas, ventilasi, dan pendingin udara (HVAC) . Pompa panas dalam banyak hal mirip dengan AC, tetapi menggunakan katup pembalik agar pompa panas dapat memanaskan dan mendinginkan ruang tertutup.<br><br>AC, yang biasanya menggunakan pendingin kompresi uap , ukurannya bervariasi dari unit kecil yang digunakan di kendaraan atau ruangan tunggal hingga unit besar yang dapat mendinginkan bangunan besar. Pompa panas sumber udara , yang dapat digunakan untuk pemanasan dan pendinginan , menjadi semakin umum di iklim yang lebih dingin.<br><br>Menurut Badan Energi Internasional (IEA), pada tahun 2018, 1,6 miliar unit AC telah terpasang, yang menyumbang sekitar 20% penggunaan listrik di gedung-gedung secara global, dan jumlah tersebut diperkirakan akan meningkat menjadi 5,6 miliar pada tahun 2050. Perserikatan Bangsa-Bangsa menyerukan agar teknologi dibuat lebih berkelanjutan untuk memitigasi perubahan iklim dan untuk penggunaan alternatif, seperti pendinginan pasif, pendinginan evaporatif , peneduh selektif, penangkap angin , dan isolasi termal yang lebih baik . Refrigeran CFC dan HCFC seperti R-12 dan R-22, yang digunakan dalam AC telah menyebabkan kerusakan pada lapisan ozon , dan refrigeran HFC seperti R-410a dan R-404a, yang dirancang untuk menggantikan CFC dan HCFC, justru memperburuk perubahan iklim . Kedua masalah tersebut terjadi karena keluarnya zat pendingin ke atmosfer, seperti saat perbaikan. Refrigeran HFO , yang digunakan pada beberapa atau bahkan sebagian besar peralatan baru, mengatasi masalah dengan potensi kerusakan ozon (ODP) nol dan potensi pemanasan global (GWP) yang jauh lebih rendah dalam satu atau dua digit vs. tiga atau empat digit HFC.<br><br><strong><em>Sejarah<br><\/em><\/strong>Proses pembuatan AC modern melibatkan banyak penelitian, pengujian, dan inovasi dari sejumlah ilmuwan dan insinyur. Berikut adalah beberapa langkah utama dalam pembuatan AC:<br><br>1. Pendahuluan Konsep : Konsep dasar pendinginan udara telah ada sejak zaman kuno, tetapi pemahaman ilmiah tentang termodinamika dan pemisahan udara dan kelembaban menjadi kunci dalam pengembangan AC modern. Penelitian awal ini membantu dalam membangun fondasi untuk pengembangan sistem pendinginan yang lebih efektif.<br><br>2. Penemuan Willis Haviland Carrier : Penemuan Willis Haviland Carrier pada tahun 1902 adalah tonggak penting dalam sejarah AC. Carrier mengembangkan sistem yang menggunakan prinsip pemisahan udara dan kelembaban untuk menciptakan udara yang lebih dingin dan lebih kering. Penemuan ini awalnya digunakan untuk tujuan industri, tetapi kemudian diadopsi untuk aplikasi komersial dan domestik.<br><br>3. Pengembangan Komponen : Proses pembuatan AC melibatkan pengembangan berbagai komponen kunci, seperti kompresor, kondensor, evaporator, dan kontrol suhu. Para insinyur terus mengembangkan dan memperbaiki komponen-komponen ini untuk meningkatkan efisiensi dan kinerja keseluruhan sistem.<br><br>4. Uji Coba dan Penyesuaian : Sebelum AC dapat diproduksi secara massal, sistem-sistem yang dikembangkan harus diuji secara menyeluruh untuk memastikan kinerjanya yang handal dan efisien. Uji coba ini melibatkan pengujian di laboratorium dan lapangan, serta penyesuaian desain dan teknik produksi berdasarkan hasil pengujian.<br><br>5. Produksi Massal dan Penyebaran : Setelah sistem AC terbukti berhasil, produksi massal dimulai untuk memenuhi permintaan pasar yang meningkat. Perusahaan-perusahaan besar dan pabrikan mengambil peran penting dalam memproduksi dan mendistribusikan AC ke berbagai tempat di seluruh dunia.<br><br>6. Inovasi Berkelanjutan : Seiring berjalannya waktu, inovasi terus dilakukan untuk meningkatkan kinerja, efisiensi energi, dan keandalan AC. Ini melibatkan pengembangan teknologi baru, seperti penggunaan refrigeran yang ramah lingkungan, integrasi sensor dan kontrol otomatis, serta peningkatan desain untuk mengurangi jejak karbon.<br><br>Proses pembuatan AC modern merupakan hasil dari kolaborasi antara ilmuwan, insinyur, produsen, dan konsumen yang bekerja bersama untuk menciptakan sistem pendinginan udara yang efektif dan terjangkau bagi berbagai aplikasi.<br> <\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:06:18",
            "updated_at": "2024-05-07 09:06:18"
        },
        {
            "id": "20",
            "category_id": "6",
            "user_id": "5",
            "title": "Ryan Gosling Adalah Saya, Sebuah Blog Tentang Film Blade Runner 2049",
            "slug": "ryan-gosling-adalah-saya-sebuah-blog-tentang-film-blade-runner-2049",
            "image": "post-images\/XX0xrsD2xGPxnEZpzGvl0xKRpN11bJ0mb3wSTcBV.jpg",
            "excerpt": "BLADE RUNNER 2049 Mungkin kalian tidak tahu apa itu film Blade Runner 2049, film ini merupakan film fiksi ilmiah Amerika Serikat tahun 2017 yang disutradarai oleh Denis Villeneuve dan diproduseri oleh...",
            "body": "<div><strong>BLADE RUNNER 2049<\/strong> Mungkin kalian tidak tahu apa itu film Blade Runner 2049, film ini merupakan film fiksi ilmiah Amerika Serikat tahun 2017 yang disutradarai oleh Denis Villeneuve dan diproduseri oleh Andrew A. Kosove, Broderick Johnson, Bud Yorkin dan Cynthia Yorkin. Naskah film ini ditulis oleh Hampton Fancher dan Michael Green, sementara ceritanya ditulis oleh Hampton Fancher berdasarkan karakter dalam buku <em>Do Androids Dream of Electric Sheep?<\/em> karya Philip K. Dick. Film ini dibintangi oleh <strong>Ryan Gosling<\/strong>, Harrison Ford, Ana de Armas, Sylvia Hoeks, Robin Wright, Mackenzie Davis, Carla Juri, Lennie James, Dave Bautista dan Jared Leto.<br><br>Film ini merupakan sekuel dari film Blade Runner tahun 1982 yang disutradarai Ridley Scott. Film ini ditayangkan secara perdana di Dolby Theatre pada tanggal 3 Oktober 2017 dan dirilis di Amerika Serikat pada tanggal 6 Oktober 2017.<br> <br>Film tersebut membuat penonton mempertanyakan tentang tujuan hidup, memperlihatkan bentuk kesepian, serta menanyakan kemanusiaan yang terdapat pada makhluk-makhluk kloningan yang disebut Replicant.<br><br>Replicant merupakan makhluk yang mirip manusia dengan kekuatan yang dapat dibilang sempurna, namun Replicant hanya berumur 5 tahun, tidak dapat bereproduksi, sangat loyal, dan penurut. Karakter yang dimainkan oleh Ryan Gosling atau Officer K merupakan seseorang Blade Runner, pekerjaan tersebut merupakan pekerjaan yang memburu Replicant pemberontak, adapun Officer K sendiri merupakan Replicant, sehingga Officer K dapat dibilang membunuh spesiesnya sendiri. Pekerjaan yang dilakukan Officer K tersebut super efektif, namun secara general Replicant sangat tidak disukai oleh Manusia, karena dianggap mengambil pekerjaan manusia. Sehingga muncul pertanyaan apakah seorang Replicant dapat disebut sebagai manusia? apakah Replicant dapat memiliki tujuan hidup walaupun hanya hidup 5 tahun? yang pada akhirnya dituangkan pada karakter Officer K yang memiliki kesepian sebagai Replicant, yang diusingkan karena kebencian manusia, dan dihindari oleh Replicant karena ketakutan.<br><br>Lalu manusia sendiri dapat mengintropeksi diri dengan kesamaan tersebut, yang lalu mereka akan menjawab, ya saya adalah <strong>Ryan Gosling<\/strong>.<br>     <br> <em> <\/em> <\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:10:38",
            "updated_at": "2024-05-07 09:20:31"
        },
        {
            "id": "21",
            "category_id": "5",
            "user_id": "3",
            "title": "Mobile Legends",
            "slug": "mobile-legends",
            "image": "post-images\/WlfTXKFofTSwooJITaRVKVyyenT3r6SVAeTo5qrT.jpg",
            "excerpt": "Mobile Legends: Bang Bang adalah permainan video seluler ber-genre multiplayer online battle arena (MOBA) yang dikembangkan dan diterbitkan oleh Moonton, anak perusahaan dari ByteDance.Dirilis pada ta...",
            "body": "<div><strong><em>Mobile Legends: Bang Bang <\/em><\/strong>adalah permainan video seluler ber-genre multiplayer online battle arena (MOBA) yang dikembangkan dan diterbitkan oleh Moonton, anak perusahaan dari ByteDance.<br><br>Dirilis pada tahun 2016, game ini semakin populer di seluruh dunia, terutama di wilayah Asia Tenggara, dan sejak itu telah melampaui 1 miliar kali unduhan, dengan puncak pemain bulanan sebanyak 100 juta. Pada tahun 2021, \"Mobile Legends: Bang Bang\" mencapai pendapatan kotor sepanjang masa sebesar US$1 miliar dengan 44 persen pendapatannya berasal dari luar Asia, menjadikannya gim seluler teratas dari genre-nya dengan daya tarik paling global.<br><br><strong><em>Alur Pemainan<br><\/em><\/strong>Mobile Legends adalah permainan MOBA yang dirancang untuk ponsel. Kedua tim masing-masing berisi lima orang berjuang untuk mencapai dan menghancurkan markas musuh sambil mempertahankan markas mereka sendiri untuk mengendalikan tiga jalur, yang dikenal sebagai jalur \"atas\", \"tengah\" dan \"bawah\", yang menghubung ke setiap markas.<br><br>Di masing-masing tim, ada lima pemain yang mengendalikan avatar sendiri-sendiri, yang dikenal sebagai \"hero\", dari perangkat mereka sendiri. Karakter lemah yang dikendalikan komputer disebut \"minion\", yang bersarang di markas tim lalu menyebar ke tiga jalur dan melawan menara serta lawan yang menghadang. Mengumpulkan EXP berguna untuk menaikkan level hero saat permainan berlangsung.<br><br><strong><em>Karakter<br><\/em><\/strong>Pada dasarnya, karakter dalam Mobile Legends dibedakan menjadi 6 peran (role) di antaranya: marksman, fighter, tank, mage, assassin dan support. Setiap peran mempunyai spesialisasi dan kemampuan yang unik. Total jumlah hero per November 2021, baik pada server orisinal (original server) maupun lanjutan (advance server) adalah 107 hero. Untuk memiliki karakter dalam Mobile Legends dibagi menjadi dua cara yaitu mendapatkan secara gratis atau dengan cara membeli.<br><br>Moonton secara teratur bekerjasama dengan negara-negara di Asia Tenggara yang merupakan pangsa pasar mereka dengan pemain Mobile Legends terbanyak di dunia dengan membuat karakter baru berlatar belakang sejarah atau cerita rakyat masing-masing negara untuk meningkatkan daya tarik permainan. Karakter yang berdasarkan kerjasama tersebut yaitu Lapu-Lapu (Filipina), Minsitthar (terinspirasi dari Kyansittha; Myanmar), Gatotkaca serta Kadita (terinspirasi terinspirasi dari Gatotkaca karya Is Yuniarto serta dari Nyi Roro Kidul; Indonesia), dan Badang (Malaysia).<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:15:08",
            "updated_at": "2024-05-07 09:55:38"
        },
        {
            "id": "22",
            "category_id": "6",
            "user_id": "3",
            "title": "13 Bom di Jakarta",
            "slug": "13-bom-di-jakarta",
            "image": "post-images\/fUODFA2vulwKolHISWYZX69lLSSQLDdsCC0lUjXc.webp",
            "excerpt": "13 Bom di Jakarta, adalah sebuah film aksi spionase Indonesia yang dirilis pada tahun 2023, disutradarai oleh Angga Dwimas Sasongko . Film yang diproduseri Visinema Pictures ini dibintangi oleh Chicco...",
            "body": "<div><strong><em>13 Bom di Jakarta, <\/em><\/strong>adalah sebuah film aksi spionase Indonesia yang dirilis pada tahun 2023, disutradarai oleh Angga Dwimas Sasongko . Film yang diproduseri Visinema Pictures ini dibintangi oleh Chicco Kurniawan, Ardhito Pramono , dan Lutesha . Tayang perdana di bioskop Indonesia pada 28 Desember 2023 dan di Malaysia 1 Februari 2024.<br><br><strong><em>Sinopsis<br><\/em><\/strong>Film ini menggambarkan sekelompok teroris yang merencanakan serangkaian pemboman di Jakarta , ibu kota Indonesia. Serangan 13 Bom bertujuan untuk menghancurkan kota dan menimbulkan banyak korban jiwa. Badan Penanggulangan Terorisme Indonesia (ICTA) menerima informasi intelijen tentang rencana bom tersebut dan segera membentuk tim agen rahasia. Tim yang dipimpin oleh Emil (Ganindra Bimo), seorang agen intelijen berpengalaman, segera mengambil tindakan untuk mencegah serangan dahsyat tersebut.<br> <br><strong><em>Pemain<br><\/em><\/strong>-Rio Dewanto sebagai Arok\/Ismail Gani<br>-Putri Ayudya sebagai Karin Anjani<br>-Chicco Kurniawan sebagai Oscar Darmawan<br>-Ardhito Pramono sebagai William Sutanto<br>-Ganindra Bimo sebagai Emil<br>-Lutesha sebagai Agnes<br>-Muhammad Khan sebagai Waluyo<br>-Rukman Rosadi sebagai Damaskus Iryawan<br>-Niken Anjani sebagai Gita Pratiwi<br>-Andri Mashadi sebagai Fajar<br>-Aksara Dena sebagai Malik<br>-Alyssa Abidin sebagai istri Malik<br>-Mila Jamila sebagai Tia<br>-Akbarry Noor sebagai Akbari (Petugas Firewall)<br>-Yusuf Ozkan sebagai Musisi Jalanan<br>-Chicco Jerikho sebagai Petugas Inspeksi ICTA<br>-Toran Waibro sebagai Asisten Karin<br>-Raeshard Octaviansha sebagai Penjaga Truk Uang<br>-Andi Sujono sebagai Andi (Asisten Gita)<br><br><strong><em>Pra-Produksi<br><\/em><\/strong>Film ini pertama kali diumumkan pada 10 April 2023, melalui postingan Instagram Angga Dwimas Sasongko. Dalam postingan tersebut, ia mengungkapkan bahwa Taufan Adryan akan memproduseri film tersebut, dan naskahnya ditulis bersama oleh dirinya dan M. Irfan Ramli, dengan pemeran yang sudah dipilih. <br> <\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:21:10",
            "updated_at": "2024-05-07 09:21:10"
        },
        {
            "id": "23",
            "category_id": "8",
            "user_id": "3",
            "title": "Java",
            "slug": "java",
            "image": "post-images\/1IdY8mI2aVX3l9A58bLMrDpg3vRiLbgi65TPHBbU.jpg",
            "excerpt": "Java adalah bahasa pemrograman yang dapat dijalankan di berbagai komputer termasuk telepon genggam. Bahasa ini awalnya dibuat oleh James Gosling saat masih bergabung di Sun Microsystems, yang saat ini...",
            "body": "<div><strong><em>Java<\/em><\/strong> adalah bahasa pemrograman yang dapat dijalankan di berbagai komputer termasuk telepon genggam. Bahasa ini awalnya dibuat oleh James Gosling saat masih bergabung di Sun Microsystems, yang saat ini merupakan bagian dari Oracle dan dirilis tahun 1995. Bahasa ini banyak mengadopsi sintaksis yang terdapat pada C dan C++ namun dengan sintaksis model objek yang lebih sederhana serta dukungan rutin-rutin aras bawah yang minimal. Aplikasi-aplikasi berbasis java umumnya dikompilasi ke dalam p-code (bytecode) dan dapat dijalankan pada berbagai Mesin Virtual Java (JVM).<br><br>Java merupakan bahasa pemrograman yang bersifat umum\/non-spesifik (general purpose), dan secara khusus didesain untuk memanfaatkan dependensi implementasi seminimal mungkin. Karena fungsionalitasnya yang memungkinkan aplikasi java mampu berjalan di beberapa platform sistem operasi yang berbeda, java dikenal pula dengan slogannya, \"Tulis sekali, jalankan di mana pun\". Saat ini java merupakan bahasa pemrograman yang paling populer digunakan, dan secara luas dimanfaatkan dalam pengembangan berbagai jenis perangkat lunak.<br><br>Oracle (dan yang lainnya) sangat merekomendasikan untuk menghapus versi lawas dan tidak didukung dari Java, karena masalah keamanan yang belum terselesaikan di versi lama. Oracle menyarankan para penggunanya untuk segera bertransisi ke versi yang mendukung, seperti salah satu versi LTS (8, 11, 17).<br><br><strong><em>Sejarah Perkembangan<br><\/em><\/strong>Bahasa pemrograman Java terlahir dari The Green Project, yang berjalan selama 18 bulan, dari awal tahun 1991 hingga musim panas 1992. Proyek tersebut belum menggunakan versi yang dinamakan Oak. Proyek ini dimotori oleh Patrick Naughton, Mike Sheridan, dan James Gosling, beserta sembilan pemrogram lainnya dari Sun Microsystems. Salah satu hasil proyek ini adalah maskot Duke yang dibuat oleh Joe Palrang.<br><br>Pertemuan proyek berlangsung di sebuah gedung perkantoran Sand Hill Road di Menlo Park. Sekitar musim panas 1992 proyek ini ditutup dengan menghasilkan sebuah program Java Oak pertama, yang ditujukan sebagai pengendali sebuah peralatan dengan teknologi layar sentuh (touch screen), seperti pada PDA sekarang ini. Teknologi baru ini dinamai \"*7\" (Star Seven).<br><br>Setelah era Star Seven selesai, sebuah anak perusahaan TV kabel tertarik ditambah beberapa orang dari proyek The Green Project. Mereka memusatkan kegiatannya pada sebuah ruangan kantor di 100 Hamilton Avenue, Palo Alto.<br><br>Perusahaan baru ini bertambah maju: jumlah karyawan meningkat dalam waktu singkat dari 13 menjadi 70 orang. Pada rentang waktu ini juga ditetapkan pemakaian Internet sebagai medium yang menjembatani kerja dan ide di antara mereka. Pada awal tahun 1990-an, Internet masih merupakan rintisan, yang dipakai hanya di kalangan akademisi dan militer.<br><br>Mereka menjadikan peramban (browser) Mosaic sebagai landasan awal untuk membuat perambah Java pertama yang dinamai Web Runner, terinsipirasi dari film 1980-an, Blade Runner. Pada perkembangan rilis pertama, Web Runner berganti nama menjadi Hot Java.<br><br>Pada sekitar bulan Maret 1995, untuk pertama kali kode sumber Java versi 1.0a2 dibuka. Kesuksesan mereka diikuti dengan untuk pemberitaan pertama kali pada surat kabar San Jose Mercury News pada tanggal 23 Mei 1995.<br><br>Sayang terjadi perpecahan di antara mereka suatu hari pada pukul 04.00 di sebuah ruangan hotel Sheraton Palace. Tiga dari pimpinan utama proyek, Eric Schmidt dan George Paolini dari Sun Microsystems bersama Marc Andreessen, membentuk Netscape.<br><br>Nama Oak, diambil dari pohon oak yang tumbuh di depan jendela ruangan kerja \"Bapak Java\", James Gosling. Nama Oak ini tidak dipakai untuk versi release Java karena sebuah perangkat lunak lain sudah terdaftar dengan merek dagang tersebut, sehingga diambil nama penggantinya menjadi \"Java\". Nama ini diambil dari kopi murni yang digiling langsung dari biji (kopi tubruk) kesukaan Gosling. Konon kopi ini berasal dari Pulau Jawa. Jadi nama bahasa pemrograman Java tidak lain berasal dari kata Jawa (bahasa Inggris untuk Jawa adalah Java).<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:38:25",
            "updated_at": "2024-05-07 09:38:25"
        },
        {
            "id": "24",
            "category_id": "4",
            "user_id": "2",
            "title": "Apple iPhone",
            "slug": "apple-iphone",
            "image": "post-images\/0Spo9e23QoIzFpmafKPIpflkxYEVnXsAPxtpbueF.jpg",
            "excerpt": "Apple memperkenalkan iPhone 15 Pro dan iPhone 15 Pro MaxCUPERTINO, CALIFORNIA Apple hari ini meluncurkan iPhone 15 Pro dan iPhone 15 Pro Max, yang didesain dengan titanium sekelas industri dirgantara...",
            "body": "<h1>Apple memperkenalkan iPhone 15 Pro dan iPhone 15 Pro Max<\/h1><div><br><strong>CUPERTINO, CALIFORNIA<\/strong> Apple hari ini meluncurkan <a href=\"https:\/\/www.apple.com\/iphone-15-pro\/\">iPhone 15 Pro dan iPhone 15 Pro Max<\/a>, yang didesain dengan titanium sekelas industri dirgantara yang kuat sekaligus ringan untuk menghadirkan model Pro paling ringan yang pernah ada dari Apple. Desain baru ini juga menyertakan tepian berkontur dan tombol Tindakan yang dapat disesuaikan, yang memungkinkan para pengguna untuk mempersonalisasi pengalaman iPhone mereka. Pembaruan kamera yang andal menyertakan kemampuan setara tujuh lensa pro dengan kualitas gambar luar biasa, termasuk sistem kamera utama 48 MP yang lebih canggih yang kini mendukung resolusi baru super tinggi dengan default 24 MP, generasi baru mode potret dengan Fokus dan Kontrol Kedalaman, peningkatan pada mode Malam dan Smart HDR, serta kamera Telefoto 5x yang sepenuhnya baru dan hanya tersedia pada iPhone 15 Pro Max. Chip A17 Pro meningkatkan pengalaman bermain game ke level berikutnya dan performa yang profesional. Konektor USB‑C menghadirkan kecepatan penuh dengan USB 3, hingga 20x lebih cepat dibandingkan dengan USB 2, dan dilengkapi dengan format video baru, menghadirkan alur kerja profesional yang andal yang tidak mungkin dilakukan sebelumnya.1<\/div><div>iPhone 15 Pro dan iPhone 15 Pro Max akan tersedia dalam empat warna menawan, termasuk titanium hitam, titanium putih, titanium biru, dan titanium alami.<\/div><div>“Ini adalah rangkaian produk paling pro yang pernah kami ciptakan, dengan desain titanium canggih, sistem kamera iPhone terbaik yang pernah ada dan memungkinkan terobosan alur kerja baru, serta chip A17 Pro, yang menghadirkan babak baru dalam performa dan game yang belum pernah ada sebelumnya di iPhone,” kata Greg Joswiak, Senior Vice President Worldwide Marketing Apple. “iPhone 15 Pro dan iPhone 15 Pro Max merepresentasikan desain terbaik dari Apple dan inovasi pertama di industri untuk membantu memperkaya pengalaman sehari-hari pengguna kami, sekaligus memungkinkan mereka mengeksplorasi kreativitas.”<br><br><strong><br>Desain Ringan, Tangguh, dan Menawan<br><\/strong><br><\/div><div>Tersedia dalam ukuran layar 6,1 inci dan 6,7 inci,2 iPhone 15 Pro dan iPhone 15 Pro Max menghadirkan desain titanium yang kuat dan ringan, yang pertama ada di iPhone. Logam campuran premium ini sama dengan material yang digunakan di pesawat luar angkasa dan memiliki salah satu rasio tertinggi kekuatan terhadap berat dari semua logam, menjadikan produk ini sebagai rangkaian produk Pro paling ringan yang pernah ada dari Apple. Kedua model ini menawarkan tekstur corak garis halus, tepian berkontur, dan bezel paling tipis di iPhone. Rangkaian produk Pro diciptakan agar tahan lama, menggabungkan kekuatan titanium dengan kaca belakang paling kuat di ponsel pintar dan Ceramic Shield paling tangguh di industri di bagian depan. Menggunakan proses termomekanik pertama di industri, lapisan titaniumnya melingkupi substruktur baru yang terbuat dari 100 persen aluminium daur ulang, mengikat kedua logam ini dengan kekuatan luar biasa melalui difusi bentuk padat. Bingkai aluminiumnya membantu pembuangan panas dan memungkinkan penggantian kaca belakang yang mudah. Desain baru ini dilengkapi dengan layar Super Retina XDR dengan teknologi Selalu Nyala dan ProMotion untuk pengalaman tampilan yang luar biasa.<br><br>Titanium premium yang digunakan di iPhone 15 Pro dan iPhone 15 Pro Max memiliki salah satu rasio tertinggi kekuatan terhadap berat dari semua logam, menjadikan produk ini sebagai rangkaian produk Pro paling ringan yang pernah ada dari Apple.<br><br><br>Tombol Tindakan yang baru menggantikan pengalih-satu-fungsi yang digunakan untuk berpindah antara mode dering dan hening. Tombol ini menawarkan opsi tambahan sehingga pengguna dapat memilih antara mengakses kamera atau senter secara cepat; mengaktifkan Memo Suara, Fokus, Terjemahkan,3dan fitur-fitur aksesibilitas seperti Pembesar; atau menggunakan Pintasan untuk opsi lebih banyak lagi. Gerakan tekan dan tahan dengan umpan balik haptik yang halus dan penanda visual di Dynamic Island memastikan tombol yang baru ini menjalankan tindakan yang diinginkan.<br><br><strong><br>A17 Pro: Generasi Baru Apple silicon untuk iPhone<br><\/strong><br><\/div><div>Menghadirkan performa dan kemampuan pro, iPhone 15 Pro dan iPhone 15 Pro Max ditenagai oleh A17 Pro, chip 3 nanometer pertama di industri. Meneruskan keunggulan Apple dalam silikon ponsel pintar, A17 Pro menghadirkan peningkatan di seluruh chip, termasuk desain ulang GPU terbesar dalam sejarah Apple. CPU barunya lebih cepat hingga 10 persen dengan peningkatan mikro-arsitektur dan desain, dan Neural Engine kini hingga 2x lebih cepat, yang memungkinkan hadirnya fitur-fitur seperti koreksi otomatis dan Suara Personal di iOS 17. GPU kelas pro lebih cepat hingga 20 persen dan menyajikan pengalaman yang baru, dilengkapi desain 6-core baru yang meningkatkan performa puncak dan efisiensi energi. Kini dengan penelusuran sinar yang diakselerasi perangkat keras, yang 4x lebih cepat dibandingkan dengan penelusuran sinar berbasis perangkat lunak, iPhone 15 Pro menawarkan grafik yang lebih halus, serta penggunaan AR dan pengalaman bermain game yang lebih imersif. iPhone 15 Pro menghadirkan pengalaman bermain game yang begitu nyata ke tangan pengguna dengan judul-judul game konsol yang belum pernah ada sebelumnya di ponsel pintar, seperti Resident Evil Village, Resident Evil 4, Death Stranding, dan Assassin’s Creed Mirage.4<\/div><div>A17 Pro menyertakan dekoder AV1 khusus, memungkinkan pengalaman video kualitas tinggi yang lebih efisien untuk layanan streaming. Selain itu, kontroler USB yang baru memungkinkan kecepatan USB 3 di iPhone untuk pertama kalinya, kini mendukung kecepatan transfer dan keluaran video hingga 4K pada kecepatan 60 fps HDR.<br><br><strong><br>Sistem Kamera Pro yang Tangguh dengan Kontrol Kreativitas Lebih Baik<br><\/strong><br><\/div><div>Melalui integrasi mendalam pada perangkat keras dan perangkat lunak, sistem kamera canggih di iPhone 15 Pro dan iPhone 15 Pro Max menyertakan kemampuan setara tujuh lensa pro yang ditenagai oleh chip A17 Pro. Berkat kecanggihan fotografi komputasi, kamera utama 48 MP, dikembangkan eksklusif untuk rangkaian produk Pro, memberi pengguna fleksibilitas lebih tinggi dengan default resolusi super tinggi 24 MP, menawarkan kualitas gambar luar biasa dengan ukuran file praktis yang ideal untuk disimpan dan dibagikan. Kamera utamanya memungkinkan pengguna memilih di antara tiga jarak fokus yang populer, yakni 24 mm, 28 mm, dan 35 mm, dan bahkan menggunakan salah satunya sebagai default yang baru. Selain ProRAW 48 MP, kamera utamanya juga mendukung format gambar HEIF 48 MP dengan resolusi 4x lebih tinggi. iPhone 15 Pro dilengkapi kamera Telefoto 3x yang ekspansif, dan iPhone 15 Pro Max memiliki zoom optik terpanjang yang pernah ada di iPhone: 5x pada 120 mm. Sempurna untuk digunakan pada foto jarak dekat, satwa liar, dan untuk menangkap peristiwa dari jarak yang lebih jauh, kamera Telefoto baru pada iPhone 15 Pro Max yang memiliki desain tetraprism dengan gabungan antara penstabilan gambar optik dan modul sensor bergerak 3D fokus otomatis adalah sistem penstabilan tercanggih Apple sejauh ini.<br><br>Mode potret generasi terbaru pada iPhone 15 Pro dan iPhone 15 Pro Max menghadirkan detail yang lebih jelas, warna yang lebih tajam, dan performa yang lebih baik dalam pencahayaan rendah. Untuk pertama kalinya, pengguna dapat mengambil potret tanpa perlu beralih ke mode Potret. Saat ada orang, anjing, atau kucing di dalam layar, atau saat pengguna mengetuk layar agar fokus, iPhone secara otomatis menangkap informasi kedalaman, sehingga pengguna dapat mengubah foto tersebut menjadi potret yang menawan nantinya di aplikasi Foto di iPhone, iPad, atau Mac. Untuk kontrol kreativitas yang lebih baik lagi, pengguna juga dapat menyesuaikan titik fokus setelah foto diambil.<br><br>Fitur tambahan yang hadir di seluruh kamera di iPhone 15 Pro dan iPhone 15 Pro Max antara lain:<\/div><ul><li>Mode Malam yang semakin baik dengan detail yang lebih jelas dan warna yang lebih tajam, kini ditenagai oleh Photonic Engine, termasuk mode potret Malam, berkat LiDAR scanner.<\/li><li>Smart HDR yang baru menangkap subjek dan latar belakang dengan warna kulit yang lebih mirip dengan aslinya, sekaligus memastikan foto memiliki sorotan yang lebih terang, midtone yang lebih kaya, dan bayangan yang lebih dalam saat dilihat di aplikasi Foto. Render HDR canggih ini juga tersedia untuk aplikasi pihak ketiga, sehingga gambar bahkan terlihat lebih bagus lagi saat dibagikan secara online.<\/li><li>Video dengan kualitas terbaik di ponsel pintar yang lebih disempurnakan berkat chip A17 Pro, dengan peningkatan pada video dengan pencahayaan rendah dan mode Aksi.<\/li><\/ul><div>Ponsel pintar pilihan pekerja kreatif profesional dan pembuat film ini semakin baik dengan alur kerja pro yang baru. Pengguna kini mendapatkan kecepatan transfer hingga 20x lebih tinggi dengan kabel USB 3 tambahan. iPhone dan solusi pihak ketiga seperti Capture One juga membantu fotografer menciptakan studio pro, memungkinkan mereka memotret dan secara langsung mentransfer gambar ProRAW 48 MP dari iPhone ke Mac. Video ProRes dapat direkam secara langsung ke penyimpanan eksternal, memungkinkan opsi perekaman hingga 4K pada kecepatan 60 pfs, dan lebih fleksibel di lapangan saat menggunakan iPhone sebagai kamera utama. iPhone 15 Pro juga memperkenalkan opsi baru untuk pengkodean Log dan merupakan ponsel pintar pertama di dunia yang mendukung ACES, Academy Color Encoding System, standar global untuk alur kerja warna.<br><br><strong><br>Performa dan Konektivitas Nirkabel Level Berikutnya<br><\/strong><br><\/div><div>Rangkaian produk iPhone 15 Pro menawarkan cara baru yang mudah untuk mengisi daya, bertemu dengan teman di tempat yang ramai, dan tetap terhubung saat sedang bepergian. Kedua model menawarkan konektor USB-C, yang merupakan standar universal untuk pengisian daya dan transfer data, memungkinkan kabel yang sama digunakan untuk mengisi daya iPhone, Mac, iPad, dan AirPods Pro (generasi ke-2) yang baru. Pengguna juga dapat mengisi daya AirPods atau Apple Watch langsung dari iPhone dengan konektor USB‑C. iPhone 15 Pro dan iPhone 15 Pro Max mendukung USB 3 untuk kecepatan transfer data hingga 10 gigabit per detik, hingga 20x lebih cepat daripada sebelumnya.<br><br>iPhone 15 Pro dan iPhone 15 Pro Max kini mendukung Wi-Fi 6E untuk performa nirkabel yang lebih baik, termasuk kecepatan 2x lebih tinggi, dan memperkenalkan ponsel pintar pertama yang mendukung Thread, membuka kesempatan di masa depan untuk integrasi aplikasi Rumah.<\/div><div>iPhone 15 Pro dan iPhone 15 Pro Max hadir dilengkapi dengan teknologi 5G super cepat,5 dan menyertakan: <\/div><ul><li>Dukungan untuk MagSafe dan pengisian daya nirkabel Qi2 di masa depan.<\/li><li>Kualitas audio yang ditingkatkan pada panggilan telepon, termasuk panggilan yang dilakukan di FaceTime atau aplikasi pihak ketiga. Kualitas suara bahkan akan lebih baik lagi saat pengguna memilih Isolasi Suara, sehingga percakapan terdengar lebih keras dan jelas, meskipun sedang berada di tempat yang bising.<\/li><li>eSIM yang didukung oleh lebih dari 295 operator. Saat berkeliling dunia, pengguna bisa dapat tetap terhubung melalui paket roaming internasional yang terjangkau dari operator mereka saat ini, atau membeli paket eSIM prabayar di lebih dari 50 negara dan wilayah, termasuk Australia, Italia, Thailand, dan lebih banyak lagi.<\/li><\/ul><div><strong><br>Menyertakan iOS 17<br><\/strong><br><\/div><div>iPhone 15 Pro dan iPhone 15 Pro Max menggunakan iOS 17,6 yang menjadikan iPhone lebih personal dan intuitif dengan fitur-fitur baru:<\/div><ul><li><strong>Telepon<\/strong> mendapatkan pembaruan besar, dengan <strong>Poster Kontak<\/strong> yang memungkinkan pengguna menyesuaikan penampilan mereka ke kontak, dan <strong>Pesan Suara Langsung<\/strong>, yang memanfaatkan keandalan chip A17 Pro untuk melihat langsung transkripsi dalam perangkat saat seseorang meninggalkan pesan suara. Pengguna bahkan dapat menjawab panggilan tersebut saat penelepon sedang meninggalkan pesannya.<\/li><li><strong>Pesan<\/strong> dilengkapi dengan pengalaman stiker yang baru, pencarian yang lebih andal, transkripsi pesan audio, dan <strong>Periksa<\/strong>, yang memungkinkan pengguna secara otomatis memberi tahu teman dan keluarga saat mereka telah sampai dengan selamat di tujuan.<\/li><li><strong>NameDrop<\/strong> memberikan pengguna cara baru menggunakan AirDrop untuk membagikan informasi kontak cukup dengan mendekatkan dua perangkat iPhone. Gerakan yang sama juga dapat digunakan untuk mengirimkan konten dan lebih banyak hal lagi melalui AirDrop, dan kini pelanggan dapat membawa perangkatnya menjauh dan menyelesaikan pengiriman file besar melalui internet.7<\/li><li><strong>Siaga<\/strong> memberi pengguna pengalaman layar penuh yang dapat disesuaikan untuk menampilkan informasi dalam sekali pandang yang didesain untuk dilihat dari jarak jauh saat iPhone berada dalam posisi menyamping saat pengisian daya. Dengan layar Selalu Aktif pada iPhone 15 Pro dan iPhone 15 Pro Max, Siaga tetap aktif untuk menampilkan informasi penting, cocok untuk digunakan di meja kerja, meja samping tempat tidur, atau meja dapur.<\/li><li><strong>Widget interaktif<\/strong> di Layar Home, Layar Terkunci, dan dalam mode Siaga memungkinkan pengguna untuk melakukan tindakan hanya dengan sekali sentuh, memudahkan pengguna menyelesaikan daftar tugas, atau memainkan atau menjeda lagu langsung dari widget.<\/li><li><strong>Safari<\/strong> menambahkan perlindungan lebih baik untuk Penelusuran Pribadi dan memperkenalkan profil, yang membantu pengguna memisahkan topik penelusuran mereka, seperti pekerjaan dan pribadi.<\/li><\/ul><div>iOS 17 menghadirkan lebih banyak pembaruan, termasuk Jurnal,8aplikasi baru yang membantu pengguna iPhone melakukan refleksi diri dan melatih bersyukur dengan menulis jurnal, peningkatan pada koreksi otomatis dan Dikte yang memudahkan pengguna memasukkan teks lebih cepat dari sebelumnya, berbagi kata sandi dan kunci sandi dengan Rantai Kunci iCloud, dan lebih banyak lagi.<\/div><div><br><strong><br>Lebih Baik untuk Lingkungan<br><\/strong><br><\/div><div>iPhone 15 Pro dan iPhone 15 Pro Max didesain dengan mempertimbangkan lingkungan. Seiring dengan langkah-langkah Apple dalam mencapai tujuannya pada tahun 2030 untuk membuat semua produknya netral karbon, dari desain ke manufaktur hingga ke penggunaan pelanggan, perusahaan ini memprioritaskan listrik bersih di seluruh rantai pasokan dan mendesain produk dengan bahan daur ulang dan bahan rendah karbon lainnya. iPhone 15 Pro dan iPhone 15 Pro Max kini menggunakan lebih banyak bahan daur ulang, dengan substruktur 100 persen aluminium daur ulang dan 100 persen kobalt daur ulang di dalam baterainya, keduanya pertama kali hadir di produk Apple. iPhone 15 Pro dan iPhone 15 Pro Max juga menyertakan 100 persen unsur logam tanah langka daur ulang di semua magnet dan 100 persen emas daur ulang di konektor USB‑C serta pelat emas dan solder timah dalam beberapa papan sirkuit cetak. Kedua model ini memenuhi standar tinggi Apple untuk efisiensi energi dan bebas merkuri, PVC, dan berilium. Lebih dari 99 persen kemasannya berbahan dasar serat, yang membawa Apple lebih dekat ke tujuannya untuk meniadakan plastik sepenuhnya dari kemasan pada tahun 2025.<\/div><div>Untuk mengurangi dampak pada bumi lebih jauh lagi, Apple tidak akan menggunakan kulit lagi di produk baru Apple mana pun, termasuk aksesori iPhone. Apple memperkenalkan FineWoven Case dengan MagSafe dan FineWoven Wallet dengan MagSafe, yang terbuat dari microtwill yang kuat dan elegan dengan tekstur halus seperti suede. Bahan ini terbuat dari 68 persen daur ulang bahan bekas konsumen dan memiliki emisi karbon jauh lebih rendah dibandingkan dengan kulit.<br><br><br><strong>Harga dan Ketersediaan<\/strong><\/div><ul><li>iPhone 15 Pro and iPhone 15 Pro Max akan tersedia dalam warna, titanium hitam, titanium putih, titanium biru, dan titanium alami.<\/li><li>iPhone 15 Pro dan iPhone 15 Pro Max akan segera hadir di Indonesia.<\/li><li>FineWoven Wallet with MagSafe dan FineWoven Case with MagSafe akan tersedia dalam lima warna baru untuk rangkaian produk iPhone 15: hitam, taupe, mulberry, pacific blue, dan evergreen. Selain Clear Case untuk iPhone 15 Pro dan iPhone 15 Pro Max, Silicone Case with MagSafe akan tersedia dalam warna hitam, storm blue, clay, pink muda, guava, orange sorbet, cypress, dan winter blue.<\/li><li>iOS 17 akan tersedia sebagai pembaruan perangkat lunak gratis pada Senin, 18 September.<\/li><li>Mulai 18 September, iCloud+ akan menawarkan dua paket baru: 6 TB dengan biaya Rp449.000 per bulan dan 12 TB dengan biaya Rp899.000 per bulan, memberikan ruang tambahan untuk menyimpan file, foto, video, dan lebih aman, dapat diakses, serta mudah untuk dibagikan. Paket-paket baru ini cocok untuk pengguna dengan perpustakaan foto dan video yang besar atau yang menggunakannya untuk Keluarga Berbagi, dan memberikan akses ke fitur-fitur premium, termasuk Relai Pribadi, Sembunyikan Email Saya, Domain Email Khusus, serta dukungan Video Aman HomeKit.<\/li><li>Pelanggan yang membeli iPhone 15 Pro dan iPhone 15 Pro Max akan menerima tiga bulan gratis Apple Arcade dan Apple Fitness+ dengan langganan baru.<\/li><\/ul><div><br><br><\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:41:28",
            "updated_at": "2024-05-07 09:44:46"
        },
        {
            "id": "25",
            "category_id": "6",
            "user_id": "5",
            "title": "SUPERHERO GILAKK!!1!!1 Blog Tentang Karakter Homelander dari The Boys",
            "slug": "superhero-gilakk-1-1-blog-tentang-karakter-homelander-dari-the-boys",
            "image": "post-images\/UB9Ia3EniKjEZG1M9ChOH51zpcaBvglqy4cFBEls.jpg",
            "excerpt": "Karakter Homelander dari film series The Boys merupakan salah satu karakter paling busuk dari banyaknya film series yang ada. Karakter Homelander sendiri awalnya merupakan karakter yang di berikan kek...",
            "body": "<div>Karakter Homelander dari film series The Boys merupakan salah satu karakter paling busuk dari banyaknya film series yang ada. Karakter Homelander sendiri awalnya merupakan karakter yang di berikan kekuatan melalui sebuah bahan kimia\/obat <em>Compound V<\/em>, obat tersebut dapat memberikan penerimanya dua efek, pertama mereka akan meledakkan kepala ataupun mengalami peledakan pembuluh darah, kedua mereka akan mendapatkan kekuatan yang dapat diambil dari bentuk genetika mereka sendiri. Homelander merupakan anak superhero lain yang bernama <em>Soldier Boy<\/em>, dia dilahirkan tanpa ayah dan ibu untuk di eksperimen pada perusahaan farmasi yang bernama Vought, ia diberi banyak eksperimen yang juga berkaitan dengan pengembangan mindset seorang pahlawan, adapun hal ini menembak kembali kepada penembaknya, karena yang terjadi adalah pada pekerjaan pertama Homelander, yang seharusnya merupakan pekerjaan mudah, menjadi kacau karena ia membunuh banyak orang secara tidak sengaja, hal tersebut terjadi karena dia hanya diajari kepahlawanan dan bukan fisika dasar serta manajement emosi, hal tersebut merupakan kelalaian dari Vought sendiri yang mengajarkan Homelander dengan cara yang sangat tidak manusiawi.<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:43:32",
            "updated_at": "2024-05-07 09:43:32"
        },
        {
            "id": "26",
            "category_id": "6",
            "user_id": "3",
            "title": "Gangnam Beauty",
            "slug": "gangnam-beauty",
            "image": "post-images\/ueLoDLG40jn2XfPIt1KVgjrwASlACE799oK8W3vd.jpg",
            "excerpt": "Gangnam Beauty (Hangul: 내 아이디는 강남미인; RR: Nae Aidineun Gangnammiin; lit. My ID is Gangnam Beauty) adalah seri televisi Korea Selatan tahun 2018 yang dibintangi oleh Im Soo-hyang, Cha Eun-woo,...",
            "body": "<div><strong><em>Gangnam Beauty <\/em><\/strong>(Hangul: 내 아이디는 강남미인; RR: Nae Aidineun Gangnammiin; lit. My ID is Gangnam Beauty) adalah seri televisi Korea Selatan tahun 2018 yang dibintangi oleh Im Soo-hyang, Cha Eun-woo, Jo Woo-ri dan Kwak Dong-yeon. Drama ini didasarkan pada webtun bernama sama yang dipublikasikan pada tahun 2016 oleh Naver Webtoon. Seri ini ditayangkan di stasiun televisi JTBC mulai tanggal 27 Juli sampai 15 September 2018 setiap hari Jumat dan Sabtu pada pukul 23:00 sebanyak 16 episode.<br><br><strong><em>Sinopsis<br><\/em><\/strong>Kang Mi-rae (Im Soo-hyang) memutuskan untuk menjalani operasi plastik setelah bertahun-tahun diganggu karena penampilannya. \"Kelahiran kembali\"-nya tampaknya berhasil pada awalnya, tetapi ketika kehidupan perkuliahannya dimulai, rencananya mulai menjadi bumerang. Tekanan menjadi \"gadis cantik\" mulai menekannya dan, lebih buruk lagi, mereka yang bisa melihat melalui penampilan hasil operasi mengejeknya dan menandainya sebagai \"monster operasi plastik Gangnam.\" Drama ini mengikuti kisah Mi-rae tentang pemulihan harga diri ketika dia mengenal teman sekelasnya, dan teman sekolahnya dulu saat di sekolah menengah, Do Kyung-seok (Cha Eun-woo).<br><br><strong><em>Pemeran<br>-<\/em><\/strong>Im Soo-hyang sebagai Kang Mi-rae<br>-Jeon Min-seo sebagai Kang Mi-rae muda<br>-Cha Eun-woo sebagai Do Kyung-seok<br>-Shin Jun-seop sebagai Do Kyung-seok muda<br>-Moon Woo-jin sebagai Do Kyung-seok kecil<br>-Jo Woo-ri sebagai Hyun Soo-a<br>-Kwak Dong-yeon sebagai Yeon Woo-young<\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:48:44",
            "updated_at": "2024-05-07 09:48:44"
        },
        {
            "id": "27",
            "category_id": "4",
            "user_id": "2",
            "title": "Samsung",
            "slug": "samsung",
            "image": "post-images\/bLm2eTO8Togn1YOgtyO8KAserLlQYYzhbqOC54q5.jpg",
            "excerpt": "Galaxy S24 UltraGalaxy AI is hereWelcome to the era of mobile AI. With Galaxy S24 Ultra in your hands, you can unleash whole new levels of creativity, productivity and possibility — starting with the...",
            "body": "<h1>Galaxy S24 Ultra<\/h1><div><figure data-trix-attachment=\"{&quot;contentType&quot;:&quot;image&quot;,&quot;height&quot;:46,&quot;url&quot;:&quot;https:\/\/images.samsung.com\/id\/smartphones\/galaxy-s24-ultra\/images\/galaxy-s24-ultra-highlights-kv-ai-text-a.jpg?imbypass=true&quot;,&quot;width&quot;:350}\" data-trix-content-type=\"image\" class=\"attachment attachment--preview\"><img src=\"https:\/\/images.samsung.com\/id\/smartphones\/galaxy-s24-ultra\/images\/galaxy-s24-ultra-highlights-kv-ai-text-a.jpg?imbypass=true\" width=\"350\" height=\"46\"><figcaption class=\"attachment__caption\"><\/figcaption><\/figure><\/div><div><strong>Galaxy AI is here<\/strong><\/div><div>Welcome to the era of mobile AI. With Galaxy S24 Ultra in your hands, you can unleash whole new levels of creativity, productivity and possibility — starting with the most important device in your life. Your smartphone.<\/div><div><strong>Epic, just like that.<br><br><br>Camera<\/strong><\/div><div><strong>\"For those who want the best night shots or image adjustment with AI\"<\/strong><\/div><div><strong>Forbes Vetted<br><br><br>Galaxy AI<\/strong><\/div><div><strong>\"The new era of AI-enhanced smartphones\"<\/strong><\/div><div><strong>GQ<br><br><\/strong><br><\/div><div><strong>Galaxy AI<\/strong><\/div><div><strong>\"Galaxy AI actually feels like the future of phones\"<\/strong><\/div><div><strong>Inverse<\/strong><\/div><div><br><br><strong>Sleek. Strong. Stunning<\/strong><\/div><div>Meet Galaxy S24 Ultra, the ultimate form of Galaxy Ultra with a new titanium exterior and a 6.8\" flat display. It's an absolute marvel of design.<br><br><strong>Armor up with titanium<\/strong><\/div><div>Check out the upgrade — a durable shield of titanium built right into the frame. The strength of titanium is now at your fingertips.<br><br><strong>Built-in S Pen writes a whole new chapter<\/strong><\/div><div>The legacy of Galaxy Note is alive and well. Write, tap and navigate with precision your fingers wish they had on the new, flat display.<br><br><strong>Top-notch NPU. Industry-leading camera. Now with AI<br><br>200MP.<\/strong><\/div><div><strong>Capture details that rival reality<\/strong><\/div><div>With the most megapixels on a smartphone and AI processing, Galaxy S24 Ultra sets the industry standard for image quality every time you hit the shutter. What's more, the new ProVisual engine recognizes objects — improving color tone, reducing noise and bringing out detail.<\/div><div><br><strong>Our most powerful Quad Tele zoom yet<\/strong><\/div><div>Don’t let long distance get you down. Now you can get 2x, 3x, 5x and even 10x close-ups with optical or optical quality zoom.Plus, the new, powerful Tele OIS is wider than before to stabilize the shot for less zoom-in blur.<br><br><strong>Digital zoom closes in, AI Zoom amps it up<\/strong><\/div><div>Go from scenic to specific thanks to deep learning-based AI Zoom. Glide seamlessly past 1x zoom all the way to 100x zoom while AI amps up the details at all the points in between.<br><br><strong>ProVisual engine shoots every night in clear detail<\/strong><\/div><div>Space Zoom puts you in the middle of the action, even at night. With 1.6x larger pixels and a wider Tele OIS, photos and videos are brighter and more stable — making even distant subjects clearly stunning.<br><br><strong>Resize it, retouch it. Just like that<\/strong><\/div><div>Something out of place? Just move it in post. New AI-powered editing options let you get the photo you wanted, like relocating objects and intelligently filling in the space they left behind.<br><br><strong>Bend time with Instant Slow-mo<\/strong><\/div><div>Turn regular videos into cinematic marvels using Instant Slow-mo. With AI-generated images between frames, all it takes is a simple touch and hold to control when to start and stop the Slow-mo effect, even on downloads.<br><br><strong>Super HDR. AI from preview to post<\/strong><\/div><div>With our latest Super HDR upgrade, camera previews display Super HDR just like your final capture. You can immediately see what your super-vivid photos and videos will look like before you even take them. Plus, it even works when you're shooting with social media app cameras.<\/div><div><br><strong>Live Translate. The easiest way to communicate<\/strong><\/div><div>Thanks to Live Translate, now you can get real-time interpretation while you're on the phone. Break down language barriers like never before — even through messaging. Reply back in your own language — it’ll get translated on their end too.<br><br><strong>An Interpreter in your pocket<\/strong><\/div><div>Want to ask a local for a recommendation? Don't worry! There's an interpreter in your pocket. Enjoy it even in airplane mode with no Wi-Fi.<br><br><strong>Pick the right tone for your text with Chat Assist<\/strong><\/div><div>Compose text messages with AI at the helm in Chat Assist. Now you can say what you mean with the voice of a professional, a close friend, even just politely. Go from \"how do I say this?\" to \"why didn't I think of that?\" in seconds.<br><br><strong>Summarize Notes in the blink of an AI<\/strong><\/div><div>Whether you're typing up a storm or jotting something down, Note Assist makes a long story short. Simply start writing, and format it into a clear, easy-to-review summary later.<\/div><div>And when you're looking for an old note, the new covers show simple summaries — keeping your screen looking organized so you can find things with ease.<br><br><strong>Our most hyper-realistic mobile gameplay yet<br><\/strong>Victory can be yours with the new Snapdragon® 8 Gen 3 for Galaxy. Faster processing gives you the power you need for all the gameplay you want. Then, manifest graphic effects in real time with ray tracing for hyper-realistic shadows and reflections.<\/div><div>And guess what? We've nearly doubled the size of Galaxy S24 Ultra's Vapor Chamber to improve heat dissipation and give you the smooth graphics experience as it was intended.<\/div><ul><li><strong>NPU 41%<\/strong><br>improved operation with AI<\/li><li><strong>GPU 30%<\/strong><br>more powerful graphics and performance<\/li><li><strong>CPU 20%<\/strong><br>faster, more energy efficient computing<\/li><\/ul><div><strong>All-day battery to play on and on<\/strong><\/div><div>With massive capacity and greater energy efficiency, Ultra's battery gives you extra life when it matters most — you know, like the epic boss battle you've been gearing up for.<\/div><ul><li><strong>Watch videos up to 30hrs<\/strong><\/li><li><strong>Listen to music up to 95hrs<\/strong><\/li><\/ul><div><strong>2600 nit display. Our brightest adaptive mobile display under the sun<\/strong><\/div><div>Our most immersive display comes with some major visibility upgrades. Corning® Gorilla® Armor reduces reflections and improves visual clarity, even in direct sunlight. Then, an improved Vision Booster enhances contrast and color for a clearly exceptional experience.<br><br><strong>Quick Share outside your ecosystem<\/strong><\/div><div>You're not limited to Galaxy phones. Use QR codes and saved contacts to share with iOS users or far-away friends and family.<br><br><strong>Secured by Samsung Knox<\/strong><\/div><div>Rest easy with our unparalleled mobile protection, fortified by the impenetrable Knox Vault, as well as Knox Matrix, Samsung's vision for multi-device security.<br><br><strong>Changes start from small steps<\/strong><\/div><div>We're moving toward a sustainable future, step by step. We believe in building a sustainable journey through small changes that could make a big difference. It feels good to do good.<br><br><\/div>",
            "published_at": null,
            "created_at": "2024-05-07 09:59:39",
            "updated_at": "2024-05-07 10:03:58"
        },
        {
            "id": "28",
            "category_id": "8",
            "user_id": "1",
            "title": "10 Konsep Matematika yang Harus Diketahui Oleh Programmer",
            "slug": "10-konsep-matematika-yang-harus-diketahui-oleh-programmer",
            "image": "post-images\/WPJ0JsYOvR52uTR8jIQNRaMs72XPj4MyBKemoRJX.png",
            "excerpt": " Anda tidak perlu menjadi ahli matematika untuk menjadi seorang programmer, tetapi matematika sangat meningkatkan keterampilan Anda.Pemrograman sering dianggap sebagai mata pelajaran yang tidak membut...",
            "body": "<div> Anda tidak perlu menjadi ahli matematika untuk menjadi seorang programmer, tetapi matematika sangat meningkatkan keterampilan Anda.<br><br>Pemrograman sering dianggap sebagai mata pelajaran yang tidak membutuhkan banyak pengetahuan matematika. Namun, meskipun Anda tidak perlu menjadi ahli matematika untuk menjadi seorang programmer, beberapa konsep matematika dapat sangat meningkatkan keterampilan pemrograman dan pemecahan masalah Anda.<br><br>Jadi, inilah 10 konsep matematika yang harus diketahui oleh setiap programmer: <br><br><\/div><div><strong>Sistem Bilangan<\/strong><\/div><div>Sistem bilangan dalam pemrograman adalah cara merepresentasikan angka dengan menggunakan simbol dan basis yang berbeda. Sistem yang paling umum adalah desimal (basis-10), biner (basis-2), heksadesimal (basis-16), dan oktal (basis-8). Setiap sistem memiliki seperangkat simbol dan aturannya sendiri untuk merepresentasikan angka. Mereka digunakan untuk tujuan yang berbeda dalam pemrograman, seperti mewakili data, alamat memori, dan nilai byte.<br><br>Kemungkinannya tidak terbatas, dan sebagai programmer, Anda memiliki kekuatan untuk memilih sistem mana yang akan digunakan tergantung pada kebutuhan proyek Anda. Apakah Anda akan tetap menggunakan sistem desimal tradisional, atau akankah Anda mengeksplorasi cara-cara baru dan kreatif untuk merepresentasikan angka? Pilihan ada di tangan Anda!<br><br><strong>Aljabar Linear<\/strong><br>Aljabar linier adalah alat matematika yang kuat yang digunakan dalam pemrograman untuk memanipulasi kumpulan data yang besar secara efisien. Aljabar linier membantu programmer membangun algoritma kompleks untuk pembelajaran mesin, grafik komputer, dan kriptografi dengan menggunakan teknik-teknik seperti operasi matriks, penjumlahan vektor, serta menemukan nilai eigen dan vektor eigen. Aljabar linier seperti sekumpulan blok bangunan yang dapat digunakan oleh pemrogram untuk membuat sistem canggih yang dapat memproses dan menganalisis data dalam skala besar.<br><br><strong>Statistik<\/strong><br>Dalam pemrograman, statistik digunakan dalam berbagai aplikasi, mulai dari deteksi penipuan hingga penelitian medis. Dengan menggunakan statistik untuk menganalisis dan menginterpretasikan data, programmer dapat membuat keputusan yang lebih tepat dan menciptakan sistem yang lebih baik. Ini seperti memiliki seorang detektif dalam tim Anda yang dapat membantu Anda memecahkan masalah yang kompleks dan mengungkap wawasan tersembunyi.<br><br><strong>Aljabar Boolean<\/strong><br>Aljabar Boolean adalah cabang matematika yang berhubungan dengan operasi logika pada variabel biner. Secara sederhana, aljabar Boolean adalah sistem matematika yang membantu kita bekerja dengan nilai benar dan salah, yang direpresentasikan sebagai 1 dan 0.<br><br>Dalam aljabar Boolean, ada tiga operasi utama: AND, OR, dan NOT.<br><br>Operasi AND diwakili oleh sebuah titik (.) dan membutuhkan dua masukan. Operasi ini menghasilkan 1 hanya jika kedua masukannya adalah 1, jika tidak, maka hasilnya adalah 0.<br>Operasi OR diwakili oleh tanda plus (+) dan juga membutuhkan dua input. Operasi ini menghasilkan 1 jika salah satu atau kedua masukannya adalah 1, jika tidak, maka hasilnya adalah 0.<br>Operasi NOT diwakili oleh sebuah bar di atas variabel (¬ atau ~) dan hanya membutuhkan satu input. Operasi ini menghasilkan nilai yang berlawanan dengan input, yaitu jika inputnya adalah 1, maka hasilnya adalah 0, dan jika inputnya adalah 0, maka hasilnya adalah 1.<br>Dengan menggunakan operasi ini, kita dapat membuat ekspresi logika yang merepresentasikan kondisi yang kompleks. Sebagai contoh, ekspresi (A AND B) ATAU (NOT A AND C) berarti bahwa kita ingin menghasilkan output 1 jika A dan B adalah 1, atau jika A adalah 0 dan C adalah 1.<br><br><strong>Floating Point<\/strong><br>Floating point dalam pemrograman seperti notasi ilmiah untuk komputer. Mereka memungkinkan berbagai macam bilangan real untuk diwakili menggunakan basis dan eksponen. Basis adalah bilangan biner yang mewakili digit signifikan dari angka tersebut, dan eksponen adalah bilangan bulat yang mewakili pangkat 2 yang dipangkatkan oleh basis. Bersama-sama, keduanya menciptakan representasi floating-point dari angka tersebut. <br><br>Representasi ini tidak selalu tepat karena ketepatan yang terbatas. Representasi ini biasanya digunakan untuk perhitungan dalam sains, teknik, dan grafik, tetapi memerlukan pertimbangan yang cermat terhadap potensi ketidakakuratan dalam kode.<br><br><strong>Logaritma<\/strong><br>Logaritma seperti alat khusus untuk memecahkan masalah yang melibatkan pertumbuhan atau peluruhan eksponensial. Logaritma membantu mengubah bilangan besar menjadi lebih kecil dan lebih mudah dikelola, sehingga membuat perhitungan menjadi lebih efisien. <br><br>Sebagai contoh, sebuah program komputer mungkin perlu menghitung hasil dari persamaan matematika yang kompleks yang melibatkan angka-angka yang sangat besar. Dengan mengambil logaritma dari angka-angka tersebut, program dapat mengubahnya menjadi nilai yang lebih kecil yang lebih mudah digunakan. Hal ini dapat secara signifikan mengurangi waktu pemrosesan dan kebutuhan memori yang diperlukan untuk menyelesaikan perhitungan.<br><br><strong>Teori Himpunan<\/strong><br>Teori Himpunan berhubungan dengan himpunan, yang merupakan kumpulan dari objek-objek yang berbeda. Dalam pemrograman, teori himpunan digunakan untuk memecahkan masalah yang melibatkan pengelompokan atau pengorganisasian data. Himpunan dapat didefinisikan sebagai kumpulan elemen yang unik. Elemen-elemen ini dapat berupa apa saja, seperti angka, string, atau bahkan himpunan lainnya.<br><br>Dalam pemrograman, teori himpunan digunakan untuk memecahkan masalah seperti mencari elemen dalam koleksi, membandingkan himpunan, dan menggabungkan atau memisahkan himpunan. Teori ini sering digunakan dalam manajemen basis data, analisis data, dan pembelajaran mesin.<br><br><strong>Kombinatorika<\/strong><br>Kombinatorika adalah tongkat ajaib untuk menghitung dan mengatur objek. Dengan menggunakan teknik kombinatorik, programmer dapat memecahkan masalah yang berkaitan dengan probabilitas, statistik, dan optimasi dalam berbagai aplikasi. <br><br>Sebagai contoh, kombinatorika dapat digunakan untuk menghasilkan angka acak atau untuk menganalisis pola dalam kumpulan data yang besar.<br><br><strong>Teori Graf<\/strong><br>Dalam pemrograman, teori graf digunakan untuk memecahkan masalah seperti menemukan jalur terpendek antara dua node dalam jaringan, mendeteksi siklus atau perulangan dalam graf, dan mengelompokkan node ke dalam komunitas. Teori graf juga digunakan dalam kecerdasan buatan dan pembelajaran mesin, di mana teori graf dapat digunakan untuk memodelkan pohon keputusan dan jaringan saraf.<br><br>Salah satu manfaat utama teori graf dalam pemrograman adalah kemampuannya untuk merepresentasikan sistem dan hubungan yang kompleks dengan cara yang sederhana dan intuitif. Dengan menggunakan graf untuk memodelkan masalah, programmer dapat menganalisis dan mengoptimalkan sistem yang kompleks dengan lebih efisien, menjadikan teori graf sebagai alat yang penting untuk beberapa aplikasi pemrograman.<br><br><strong>Teori Kompleksitas<\/strong><br>Teori kompleksitas seperti memiliki GPS untuk pemrograman. Teori ini membantu Anda menavigasi lanskap masalah dan algoritma yang luas, dan menemukan jalur yang paling efisien ke tujuan Anda. Salah satu manfaat utama teori kompleksitas dalam pemrograman adalah kemampuannya untuk mengidentifikasi algo yang paling efisien untuk memecahkan masalah. <br><br>Masalah yang paling terkenal dalam teori kompleksitas adalah masalah \"P vs NP\", yang menanyakan apakah ada masalah yang mudah diverifikasi tetapi sulit dipecahkan. Jika ada, maka masalah tersebut dianggap berada di kelas \"NP\", sedangkan masalah yang dapat diselesaikan secara efisien berada di kelas \"P\".<br> <\/div>",
            "published_at": null,
            "created_at": "2024-05-07 13:55:06",
            "updated_at": "2024-05-07 14:17:18"
        },
        {
            "id": "29",
            "category_id": "5",
            "user_id": "5",
            "title": "Rimworld merilis DLC (Downloadable Content) terbarunya",
            "slug": "rimworld-merilis-dlc-downloadable-content-terbarunya",
            "image": "post-images\/ANckuCLpOD2WOhixe8W8FLPwms9pc15E4DMTP9h8.jpg",
            "excerpt": "DLC terbaru Rimworld garapan Ludeon Studios yang telah ditunggu-tunggu kini telah tiba, kali ini akan ada DLC bertema horor yang dimana player akan membuat koloni dengan ekspansi gameplay dimulai keti...",
            "body": "<div>DLC terbaru Rimworld garapan Ludeon Studios yang telah ditunggu-tunggu kini telah tiba, kali ini akan ada DLC bertema horor yang dimana player akan membuat koloni dengan ekspansi <em>gameplay<\/em> dimulai ketika player mengaktifkan sebuah makhluk <em>superintelligence. <\/em>Selanjutnya player akan dibombardir dengan kegilaan mengerikan, makhluk-makhluk monster, parasit otak, dan fenomena pengikis kejiwaan lainnya.<br><br>Adapun hal tersebut bukan lah hal yang hanya merugikan player, player pun dapat melakukan beberapa ritual tentang ekspansi tersebut, yang dapat membantu player dalam membangun koloninya, untuk melanjutkan progres player dapat melakukan penelitian dengan makhluk-makhluk anomali yang terdapat pada ekspansi Rimworld ini. Dalam ekspansi ini terdapat 2 ending baru yang dapat ditemukan oleh player, yang dapat diraih melalui pengaktifan monolith hingga level terakhir.<br> <\/div>",
            "published_at": null,
            "created_at": "2024-05-08 04:42:09",
            "updated_at": "2024-05-08 04:43:15"
        },
        {
            "id": "30",
            "category_id": "7",
            "user_id": "5",
            "title": "Ayam Geprek, makanan nasional mahasiswa",
            "slug": "ayam-geprek-makanan-nasional-mahasiswa",
            "image": "post-images\/kDuRkKXexNLHQxOh16iQfM34zXeFBM97IngvOxnF.png",
            "excerpt": "Ayam Geprek merupakan ayam tepung khas indonesia yang di geprek atau diulek lalu di hujani sambal yang nikmat diatasnya. beberapa sumber mengatakan bahwa ayam geprek berasal dari Kota Yogyakarta, kini...",
            "body": "<div>Ayam Geprek merupakan ayam tepung khas indonesia yang di geprek atau diulek lalu di hujani sambal yang nikmat diatasnya. beberapa sumber mengatakan bahwa ayam geprek berasal dari Kota Yogyakarta, kini ayam geprek telah menjadi hidangan yang sangat populer dengan mahasiswa-mahasiswa di indonesia.<br><br>Terdapat sumber yang menyebut bahwa hidangan ayam geprek muncul dari Kota Yogyakarta buatan bu Ruminah atau dikenal sebagai Bu Rum yang awalnya menjual lotek, soto dan ayam goreng tepung di warungnya, tak disangka yang meminta pembuatan ayam geprek merupakan mahasiswa asal kudus.<br>untuk menambahkan sambal ulek diatas ayam goreng tepungnya dan melumatkannya dengan ulekan, awalnya sempat disebut \"ayam ulek\" atau \"ayam gejrot\". kepopuleran muncul sekitar tahun 2017, hingga sekarang banyak restoran lain yang menyajikannya.<br><br><em><br><\/em>Berikut Penyajian ayam Geprek menurut wikipedia: Geprek adalah istilah dalam bahasa Jawa yang berarti \"dipukul\", \"ditekan\", atau \"dilumatkan\", maka ayam geprek berarti \"ayam yang dipukul\". Hidangan ini mirip dengan masakan Jawa tradisional ayam penyet, karena keduanya adalah sama-sama ayam goreng yang dipukul dan ditekan menggunakan ulekan dan dicampur dengan sambal. Perbedaannya, ayam penyet adalah ayam goreng tradisional Jawa yang diungkep dengan bumbu kuning, kemudian digoreng rendam dalam minyak goreng panas. Sementara ayam geprek lebih mirip dengan ayam goreng gaya barat (lazim disebut fried chicken Amerika), yakni ayam goreng tepung yang renyah yang dilapisi dengan adonan tepung terigu sebelum digoreng.<br><br>Selain berbeda jenis ayam gorengnya, cara penyajiannya pun berbeda. Ayam penyet dipukul dan ditekan menggunakan ulekan sampai pipih, kemudian sambal dilumuri di atas ayam tersebut. Sementara ayam geprek tidak hanya dipukul dan ditekan, namun diulek hingga dagingnya terlepas dari tulangnya dan bercampur bersama dengan sambalnya. Sehingga proses penyajian ayam geprek persis dengan proses pembuatan sambal-sambal tradisional seperti sambal tempe.<\/div>",
            "published_at": null,
            "created_at": "2024-05-08 04:55:49",
            "updated_at": "2024-05-08 04:55:49"
        }
    ]
}